{
  "NEW RELIC INC": {
    "details": {
      "summary": "New Relic, Inc., a software-as-a-service company, provides platform for engineers to plan, build, deploy, and operate software worldwide. It offers a suite of products on its open and extensible cloud-based platform, New Relic One Platform, which enables users to collect, store, and analyze telemetry data flowing through and about their software. The company also provides prebuilt dashboards and visualizations, as well as the ability to search across data types, create customized dashboards, and build applications that can be shared and customized by other users. In addition, it offers customers with software code to add to their applications and infrastructure; open data application performance interfaces, and software development kits, as well as open source connectors and technologies for customers, partners, and third-party developers to extend its platform into their products; cloud-based architecture and big data database; and New Relic Application Performance Monitoring, Mobile, Browser, Synthetics, Infrastructure, and Insights products for analyzing data. Further, the company provides New Relic chart builder, dashboards, and programmability features that allow customers to use connected data to build visuals; New Relic Applied Intelligence to spot abnormal behavior across billions of pieces of data; and New Relic Alerts, which provides a centralized notification system. It sells its products through direct sales organizations, and online and offline sales. The company was founded in 2007 and is headquartered in San Francisco, California.",
      "market_cap": 4342344704,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "SYNOPSYS INC": {
    "details": {
      "summary": "Synopsys, Inc. provides electronic design automation software products used to design and test integrated circuits. The company offers Fusion Design Platform that provides digital design implementation solutions; Verification Continuum Platform that provides virtual prototyping, static and formal verification, simulation, emulation, field programmable gate array (FPGA)-based prototyping, and debug solutions; and FPGA design products that are programmed to perform specific functions. It also provides intellectual property (IP) solutions for USB, PCI Express, DDR, Ethernet, SATA, MIPI, HDMI, and Bluetooth low energy applications; analog IP, including data converters and audio codecs; and system-on-chip (SoC) infrastructure IP, datapath and building block IP, and verification IP products, as well as mathematical and floating-point components, and Arm AMBA interconnect fabric and peripherals. In addition, the company offers logic libraries and embedded memories; configurable processor cores and application-specific instruction-set processor tools for embedded applications; IP subsystems for audio, sensor, and data fusion functionality; and security IP solutions. Further, it provides Platform Architect solutions for SoC architecture analysis and optimization; virtual prototyping solutions; and HAPS FPGA-based prototyping systems, as well as a series of tools used in the design of optical systems and photonic devices. Additionally, the company offers security testing, managed services, programs and professional services, and training that enable its customers to detect and remediate security vulnerabilities, and defects in the software development lifecycle, as well as manufacturing solutions. It serves electronics, financial services, automotive, medicine, energy, and industrial areas. The company was incorporated in 1986 and is headquartered in Mountain View, California.",
      "market_cap": 48717635584,
      "dividend_yield": null
    },
    "roce": 0.6043911316632739,
    "ebit": {
      "2020-11-01SEP2021-10-31": "38311000"
    },
    "ebitda": {
      "2020-11-01SEP2021-10-31": "38311000203676000"
    },
    "high_low": {
      "high": 377.6000061035156,
      "low": 370.19000244140625
    }
  },
  "AUTODESK INC": {
    "details": {
      "summary": "Autodesk, Inc. provides 3D design, engineering, and entertainment software and services worldwide. The company offers AutoCAD Civil 3D, a surveying, design, analysis, and documentation solution for civil engineering, including land development, transportation, and environmental projects; BIM 360, a construction management cloud-based software; AutoCAD, a software for professional design, drafting, detailing, and visualization; AutoCAD LT, a drafting and detailing software; computer-aided manufacturing (CAM) software for computer numeric control machining, inspection, and modelling for manufacturing; Fusion 360, a 3D CAD, CAM, and computer-aided engineering tool; and Industry Collections tools for professionals in architecture, engineering and construction, product design and manufacturing, and media and entertainment collection industries. It also provides Inventor tools for 3D mechanical design, simulation, analysis, tooling, visualization, and documentation; Vault, a data management software to manage data in one central location, accelerate design processes, and streamline internal/external collaboration; Maya and 3ds Max software products that offer 3D modeling, animation, effects, rendering, and compositing solutions; and ShotGrid, a cloud-based software for review and production tracking in the media and entertainment industry. It sells its products and services to customers directly, as well as through a network of resellers and distributors. Autodesk, Inc. was incorporated in 1982 and is headquartered in San Rafael, California.",
      "market_cap": 46920241152,
      "dividend_yield": null
    },
    "roce": 13.433679906033847,
    "ebit": {
      "2021-02-01SEP2022-01-31": "617600000"
    },
    "ebitda": {
      "2021-02-01SEP2022-01-31": "617600000148100000"
    },
    "high_low": {
      "high": 344.3900146484375,
      "low": 339.3299865722656
    }
  },
  "JFROG LTD": {
    "details": {
      "summary": "JFrog Ltd. provides DevOps platform in the United States. The company's products include JFrog Artifactory, a package repository that allows teams and organizations to store, update, and manage their software packages at any scale; JFrog Pipelines, an integration/continuous delivery tool for automating and orchestrating the movement of software packages; JFrog Xray, which scan JFrog Artifactory; and JFrog Distribution that provides software package distribution with enterprise-grade performance. Its products include JFrog Artifactory Edge that utilizes and leverages metadata from JFrog Artifactory to facilitate the transfer of the incremental changes in software packages from their previous versions; JFrog Mission Control, a platform control panel that provides a view of moving pieces of an organization's software supply chain workflow; JFrog Insight, a DevOps intelligence tool; and JFrog Connect, a device management solution that allows companies to manage software updates and monitor performance across IoT device fleets from anywhere in the world. The company's products also comprise JFrog Pro, JFrog Pro Team, JFrog Pro X, JFrog Enterprise, JFrog Enterprise X, and JFrog Enterprise Plus products that offer ongoing updates, upgrades, and bug fixes, as well as cluster configuration, multi-site replication, and SLA support. It serves technology, financial services, retail, healthcare, and telecommunications organizations. JFrog Ltd. was incorporated in 2008 and is headquartered in Sunnyvale, California.",
      "market_cap": 2547709184,
      "dividend_yield": null
    },
    "roce": -10.09488175955019,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-68369000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-683690008746000"
    },
    "high_low": {
      "high": 54.04999923706055,
      "low": 52.0099983215332
    }
  },
  "PAYLOCITY HOLDING CORP": {
    "details": {
      "summary": "Paylocity Holding Corporation provides cloud-based payroll and human capital management software solutions for medium-sized organizations in the United States. The company offers Payroll and Tax Services solution to simplify payroll, automate processes and manage compliance requirements within one system; expense management, on demand payment, and garnishment solutions; human capital management and employee self-service solutions, document library, compliance dashboard, and HR edge; time and attendance solution, which tracks time and attendance data, eliminating the need for manual tracking of accruals and reducing administrative tasks; schedule tracking services; and time collection devices, including kiosks, time clocks, and mobile and web applications. In addition, the company offers talent management solutions comprising recruiting and onboarding, as well as learning, performance, and compensation management; employee benefits management and third-party administrative solutions; modern workforce solutions consisting of community, premium video, survey, and peer recognition; and analytics and insights solutions covering modern workforce index, data insights, and reporting. Further, it provides implementation and training, client, and tax and regulatory services. The company's clients include for-profit and non-profit organizations across industries, including business services, financial services, healthcare, manufacturing, restaurants, retail, technology, and others. It sells its products through sales representatives. The company was founded in 1997 and is headquartered in Schaumburg, Illinois.",
      "market_cap": 11777071104,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "ZSCALER INC": {
    "details": {
      "summary": "Zscaler, Inc. operates as a cloud security company worldwide. The company provides Zscaler Internet Access solution that provides users, servers, operational technology, Internet of Things device secure access to externally managed applications, including software-as-a-service (SaaS) applications and Internet destinations; and Zscaler Private Access solution, which is designed to provide access to managed applications hosted internally in data centers, and private or public clouds. It also offers Zscaler Digital Experience that measures end-to-end user experience across business applications, as well as provides an easy to understand digital experience score for each user, application, and location within an enterprise. In addition, the company provides workload segmentation solutions comprising Zscaler Cloud Security Posture Management that identifies and remediates application misconfigurations in SaaS, infrastructure as a service, and platform as a service to reduce risk and ensure compliance with industry and organizational benchmarks; and Zscaler Cloud Workload Segmentation, which is designed to secure application-to-application communications inside public clouds and data centers to stop lateral threat movement, as well as prevents application compromise and reduces the risk of data breaches. Its platform modules include Zscaler Central Authority, Zscaler Enforcement Node, and Zscaler Log Servers. It serves customers in airlines and transportation, conglomerates, consumer goods and retail, financial services, healthcare, manufacturing, media and communications, public sector and education, technology, and telecommunications services industries. The company was formerly known as SafeChannel, Inc., and changed its name to Zscaler, Inc. in August 2008. Zscaler, Inc. was incorporated in 2007 and is headquartered in San Jose, California.",
      "market_cap": 31421038592,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "ACI WORLDWIDE INC": {
    "details": {
      "summary": "ACI Worldwide, Inc., a software company, develops, markets, installs, and supports a range of software products and solutions for facilitating digital payments to banks, merchants, and billers worldwide. The company offers ACI Acquiring, a merchant management system to deliver digital innovation, improve fraud prevention, and reduce interchange fees; ACI Issuing, a digital payments issuing solution; and ACI Enterprise Payments Platform that provides payment processing and orchestration capabilities for digital payments. It also provides ACI Low Value Real-Time Payments, a platform for processing real-time payments; and ACI High Value Real-Time Payments, a payments engine that offers multi-bank, multi-currency, 24x7 payment processing, and SWIFT messaging. In addition, the company offers ACI Omni Commerce, a scalable, omni-channel payment processing platform; ACI Secure eCommerce solution; ACI Fraud Management, a real-time approach to fraud management; ACI Digital Business Banking, a cloud-based digital banking platform; and ACI Speedpay, an integrated suite of digital billing, payment, disbursement, and communication services. The company offers electronic bill presentment and payment services to consumer finance, insurance, healthcare, higher education, utility, government, and mortgage sectors; implementation services, including product installations and configurations, and custom software modifications; and business and technical consultancy, on-site support, product education, and testing services, as well as distributes or acts as a sales agent for software developed by third parties. It markets its products under the ACI Worldwide brand. The company was formerly known as Transaction Systems Architects, Inc. and changed its name to ACI Worldwide, Inc. in July 2007. The company was founded in 1975 and is based in Coral Gables, Florida.",
      "market_cap": 3827028480,
      "dividend_yield": null
    },
    "roce": 8.729028614489147,
    "ebit": {
      "2021-01-01SEP2021-12-31": "209897000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "20989700020900000"
    },
    "high_low": {
      "high": 41.15999984741211,
      "low": 40.5
    }
  },
  "MICROSTRATEGY INC": {
    "details": {
      "summary": "MicroStrategy Incorporated provides enterprise analytics software and services worldwide. It offers MicroStrategy, an enterprise platform, which provides a modern analytics experience by delivering insights across multiple devices to users via hyperintelligence products, visualization and reporting capabilities, mobility features, and custom applications developed on the platform; analysts and data scientists with seamless access to trusted, governed data directly within their tools; and APIs and gateways, multiple deployment options, enterprise semantic graph, scalability, and security. The company also provides MicroStrategy Support that helps customers to achieve their system availability and uptime goals, and to improve the overall experience through highly responsive troubleshooting and proactive technical product support. In addition, it offers MicroStrategy Consulting that provides customers with architecture and implementation services to help them quickly realize results, and helps to achieve returns on investment derived from understanding of data; and MicroStrategy Education that offers free and paid learning options. The company provides its services through enterprise sales force and channel partners. It serves companies from a range of industries, including retail, consulting, technology, manufacturing, finance, banking, insurance, healthcare, education, and telecommunications, as well as the public sector. The company was incorporated in 1989 and is headquartered in Tysons Corner, Virginia.",
      "market_cap": 4672860160,
      "dividend_yield": null
    },
    "roce": -24.17545134430297,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-784527000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-78452700011358000"
    },
    "high_low": {
      "high": 891.3800048828125,
      "low": 840.280029296875
    }
  },
  "VERTEX INC": {
    "details": {
      "summary": "Vertex, Inc. provides tax technology solutions for corporations in retail, communication, leasing, and manufacturing industries in the United States and internationally. It offers tax determination, compliance and reporting, tax data management, document management, pre-built integration, and industry-specific solutions. The company sells its software products through software license and software as a service subscriptions. It also provides implementation and training services in connection with its software license and cloud subscriptions, transaction tax returns outsourcing, and other tax-related services. Vertex, Inc. was founded in 1978 and is headquartered in King of Prussia, Pennsylvania.",
      "market_cap": 2222848768,
      "dividend_yield": null
    },
    "roce": -0.977165158183177,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-2942000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-294200044782000"
    },
    "high_low": {
      "high": 26.670000076293945,
      "low": 25.8700008392334
    }
  },
  "WORKIVA INC": {
    "details": {
      "summary": "Workiva Inc., together with its subsidiaries, provides cloud-based compliance and regulatory reporting solutions worldwide. The company offers Workiva platform that offers controlled collaboration, data linking, data integrations, granular permissions, process management, and full audit trail services; and provides tools that enables customers to connect data from enterprise resource planning, governance risk and compliance, human capital management, and customer relationship management systems, as well as from other third-party cloud and on-premise applications. It serves public and private companies, government agencies, and higher-education institutions. The company was founded in 2008 and is headquartered in Ames, Iowa.",
      "market_cap": 5598918656,
      "dividend_yield": null
    },
    "roce": -20.928989020390702,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-29355000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-293550005244000"
    },
    "high_low": {
      "high": 173.24000549316406,
      "low": 159.28500366210938
    }
  },
  "VIRNETX HOLDING CORP": {
    "details": {
      "summary": "VirnetX Holding Corporation, through its subsidiary VirnetX, Inc., operates as an Internet security software and technology company primarily in the United States. The company develops software and technology solutions, including secure domain name registry and GABRIEL Connection Technology that are designed to secure communications over the Internet, as well as enable organizations and individuals to establish communities of secure, registered users, and transmit information between various devices, networks, and operating systems. It also offers a portfolio of licenses and services, such as VirnetX technology licensing; GABRIEL Connection Technology software development kit, including object libraries, sample code, testing and quality assurance tools, and supporting documentation required for customers to implement the company's technology; secure domain name registrar service; registrar server software; connection server software; relay server software; and secure domain name master registry and connection, and technical support services. In addition, the company provides GABRIEL Collaboration Suite that enables seamless and secure cross-platform communications between users' devices. The company serves domain infrastructure and communication service providers, and system integrators; and enterprise customers, developers, and original equipment manufacturers of chips, servers, smart phones, tablets, e-Readers, laptops, net books, and other devices in the IP-telephony, mobility, fixed-mobile convergence, and unified communications markets. VirnetX Holding Corporation was incorporated in 2005 and is based in Zephyr Cove, Nevada.",
      "market_cap": 147452096,
      "dividend_yield": null
    },
    "roce": -26.042378311964114,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-49174000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-491740004000"
    },
    "high_low": {
      "high": 6.21999979019165,
      "low": 5.980000019073486
    }
  },
  "APPIAN CORP": {
    "details": {
      "summary": "Appian Corporation provides low-code automation platform in the United States and internationally. The company's platform automates the creation of forms, workflows, data structures, reports, user interfaces, and other software elements that are needed to be manually coded. The company also offers professional and customer support services. It serves to financial services, government, life sciences, insurance, manufacturing, energy, healthcare, telecommunications, and transportation industries. The company was incorporated in 1999 and is headquartered in McLean, Virginia.",
      "market_cap": 4530570752,
      "dividend_yield": null
    },
    "roce": -29.053871564207505,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-83907000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-839070005743000"
    },
    "high_low": {
      "high": 163.27999877929688,
      "low": 153.71400451660156
    }
  },
  "PALO ALTO NETWORKS INC": {
    "details": {
      "summary": "Palo Alto Networks, Inc. provides cybersecurity solutions worldwide. The company offers firewall appliances and software; Panorama, a security management solution for the control of firewall appliances and software deployed on an end-customer's network and instances in public or private cloud environments, as a virtual or a physical appliance; and virtual system upgrades, which are available as extensions to the virtual system capacity that ships with physical appliances. It also provides subscription services covering the areas of threat prevention, malware and persistent threat, uniform resource locator filtering, laptop and mobile device protection, and firewall; and DNS security, Internet of Things security, SaaS security API, and SaaS security inline, as well as threat intelligence, and data loss prevention. In addition, the company offers cloud security, secure access, security analytics and automation, and threat intelligence and cyber security consulting; professional services, including architecture design and planning, implementation, configuration, and firewall migration; education services, such as certifications, as well as online and in-classroom training; and support services. Palo Alto Networks, Inc. sells its products and services through its channel partners, as well as directly to medium to large enterprises, service providers, and government entities operating in various industries, including education, energy, financial services, government entities, healthcare, Internet and media, manufacturing, public sector, and telecommunications. The company was incorporated in 2005 and is headquartered in Santa Clara, California.",
      "market_cap": 56827469824,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "EGAIN CORP": {
    "details": {
      "summary": "eGain Corporation develops, licenses, implements, and supports customer service infrastructure software solutions in North America, Europe, the Middle East, Africa, and the Asia Pacific. It provides unified cloud software solutions to automate, augment, and orchestrate customer engagement. It also offers subscription services that provides customers with access to its software on a cloud-based platform; and professional services, such as consulting, implementation, and training services. It serves customers in various industry sectors, including the financial services, telecommunications, retail, government, healthcare, and utilities. The company was incorporated in 1997 and is headquartered in Sunnyvale, California.",
      "market_cap": 369736032,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "TYLER TECHNOLOGIES INC": {
    "details": {
      "summary": "Tyler Technologies, Inc. provides integrated information management solutions and services for the public sector. The company operates in three segments: Enterprise Software; Appraisal and Tax; and NIC. It offers financial management solutions, including modular fund accounting systems for government agencies or not-for-profit entities; utility billing systems for the billing and collection of metered and non-metered services; products to automate city and county functions, such as municipal courts, parking tickets, equipment and project costing, animal and business licenses, permits and inspections, code enforcement, citizen complaint tracking, ambulance billing, fleet maintenance, and cemetery records management; and student information and transportation solutions for K-12 schools. The company also provides a suite of judicial solutions comprising court case management, court and law enforcement, prosecutor, and supervision systems to handle multi-jurisdictional county or statewide implementations, and single county systems; public safety software solutions; systems and software to automate the appraisal and assessment of real and personal property, as well as tax applications for agencies that bill and collect taxes; planning, regulatory, and maintenance software solutions for public sector agencies; software applications to enhance and automate operations involving records and document management; and data and insights solutions. In addition, it offers software as a service arrangements and electronic document filing solutions for courts and law offices; software and hardware installation, data conversion, training, product modification, and maintenance and support services; and property appraisal outsourcing services for taxing jurisdictions. The company has a strategic collaboration agreement with Amazon Web Services for cloud hosting services. Tyler Technologies, Inc. was founded in 1966 and is headquartered in Plano, Texas.",
      "market_cap": 18027706368,
      "dividend_yield": null
    },
    "roce": 11.283526346951845,
    "ebit": {
      "2021-01-01SEP2021-12-31": "271185000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "27118500025554000"
    },
    "high_low": {
      "high": 557.5499877929688,
      "low": 548.1500244140625
    }
  },
  "SEACHANGE INTERNATIONAL INC": {
    "details": {
      "summary": "SeaChange International, Inc. provides multiscreen, advertising, and premium over the top (OTT) video products and services that facilitate the aggregation, licensing, management, and distribution of video and advertising content worldwide. It offers video products, including SeaChange Adrenalin, a multiscreen video back office platform that enables service providers to manage, monetize, and deliver a seamless viewing experience across televisions, personal computers (PCs), tablets, smartphones, and other IP-enabled devices; MediaMaker, an OTT video cloud platform that enables operators, broadcasters, media companies, and content owners to ingest, manage, monetize, and distribute their content across networks and devices; and SeaChange AssetFlow, a content management solution, which is used to receive, manage, and publish content for viewing on televisions, tablets, PCs, and other consumer devices. The company also provides advertising products, such as SeaChange Infusion, an advertising platform to maximize advertising revenue across multiscreen, broadcast, on-demand, and OTT viewing. In addition, it offers SeaChange NitroX, an user experience product that empower service providers and content owners to optimize live and on-demand video consumption on multiscreen and OTT services. Further, the company provides professional, and maintenance and technical support services, as well as managed services. It sells and markets its products and services through a direct sales process, as well as to systems integrators and value-added resellers. The company serves cable system operators, telecommunications companies, and satellite operators, as well as broadcasters and other content providers. SeaChange International, Inc. was incorporated in 1993 and is based in Boston, Massachusetts.",
      "market_cap": 55820032,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "FASTLY INC": {
    "details": {
      "summary": "Fastly, Inc. operates an edge cloud platform for processing, serving, and securing its customer's applications in the United States, the Asia Pacific, Europe, and internationally. The edge cloud is a category of Infrastructure as a Service that enables developers to build, secure, and deliver digital experiences at the edge of the internet. It is a programmable platform designed for web and application delivery. The company offers Compute@Edge; developer hub that includes solution library patterns and recipes, API and language references, change logs, and Fastly Fiddle solutions; device detection and geolocation, edge dictionaries, edge access control lists, and edge authentication services; full site delivery services, such as dynamic site acceleration, origin shield, instant purge, surrogate keys, real-time logging and stats, cloud optimizer, programmatic control, edge databases, content compression, reliability, and modern protocols and performance services; and streaming solutions and services, including live streaming, media shield, and origin connect. It also provides edge security solutions, such as DDoS protection and cloud, edge web application firewall (WAF), transport layer security (TLS), platform TLS, and compliance services; unified web application and API protection solutions that includes runtime self-application protection, advanced rate limiting, API and ATO protection, account takeover protection, bot protection, and next generation WAF. In addition, the company offers edge applications, such as load balancers and image optimizers; video on demand; and managed edge delivery services. It serves customers operating in digital publishing, media and entertainment, technology, online retail, travel and hospitality, and financial services industries. The company was formerly known as SkyCache, Inc. and changed its name to Fastly, Inc. in May 2012. Fastly, Inc. was incorporated in 2011 and is headquartered in San Francisco, California.",
      "market_cap": 2081993728,
      "dividend_yield": null
    },
    "roce": -10.804391193933546,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-219021000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-21902100028799000"
    },
    "high_low": {
      "high": 75.1500015258789,
      "low": 70.95999908447266
    }
  },
  "BENTLEY SYSTEMS INC": {
    "details": {
      "summary": "Bentley Systems, Incorporated, together with its subsidiaries, provides infrastructure engineering software solutions in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. The company offers open modeling and open simulation applications for infrastructure design integration, which include MicroStation, OpenRoads, OpenRail, OpenPlant, OpenBuildings, OpenBridge, OpenSite, OpenFlows, STAAD and RAM, SACS, MOSES, AutoPIPE, SITEOPS, CUBE, DYNAMEQ, EMME, and LEGION; and geoprofessional applications for modeling and simulation of near and deep subsurface conditions, including Leapfrog, AGS Workbench, GeoStudio, Imago, MX Deposit, Oasis montaj, PLAXIS, and OpenGround. It also provides project delivery systems that support collaboration, work-sharing, and 4D construction modeling for infrastructure project delivery enterprises, such as ProjectWise, ProjectWise Design Review Service, and SYNCHRO; and asset and network performance systems, such as AssetWise ALIM, AssetWise Asset Reliability, AssetWise Enterprise Interoperability, AssetWise 4D Analytics, AssetWise Linear, and Seequent Central. In addition, it offers industry solutions comprising AssetWise Linear SUPERLOAD, AssetWise Linear Analytics, AssetWise Inspections, ContextCapture, OpenCities, OpenUtilities, OpenTower, OpenWindPower, Power Line, SPIDA, OrbitGT, sensemetrics, PlantSight, and WaterSight. The company serves civil, structural, geotechnical, geoscience subsurface engineers, architects, geospatial professionals, city and regional planners, contractors, fabricators, and operations and maintenance engineers. Bentley Systems, Incorporated was incorporated in 1984 and is headquartered in Exton, Pennsylvania.",
      "market_cap": 11155803136,
      "dividend_yield": 0.0032
    },
    "roce": 4.57976274457494,
    "ebit": {
      "2021-01-01SEP2021-12-31": "94589000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "9458900052793000"
    },
    "high_low": {
      "high": 71.91999816894531,
      "low": 68.73999786376953
    }
  },
  "ECOARK HOLDINGS INC": {
    "details": {
      "summary": "Ecoark Holdings, Inc., through its subsidiaries, engages in oil and gas, financial services, and food freshness management solution businesses in the United States. It engages in the exploration, production, and drilling of oil and gas properties in Texas, Louisiana, and Mississippi, as well as provides transportation of frac sand and logistics services to hydraulic fracturing and drilling operations. The company also provides freshness management solutions for fresh food growers, suppliers, processors, distributors, grocers, and restaurants. In addition, it offers Zest Fresh solution, a cloud-based post-harvest shelf-life and freshness management solution that matches customer freshness requirements with actual product freshness and reduces post-harvest losses; and Zest Delivery solution, which provides real-time monitoring and control for prepared food delivery containers, and helps delivery and dispatch personnel to ensure the quality and safety of delivered food. Further, the company is involved in financial activities, including investing in various early stage startups. Ecoark Holdings, Inc. was founded in 2011 and is based in San Antonio, Texas.",
      "market_cap": 67602008,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "TENABLE HOLDINGS INC": {
    "details": {
      "summary": "Tenable Holdings, Inc. provides cyber exposure solutions for in the Americas, Europe, the Middle East, Africa, the Asia Pacific, and Japan. Its platforms include Tenable.io, a cloud-delivered software as a service that provides organizations with a risk-based view of traditional and modern attack surfaces; Tenable.cs, a cloud-native application platform that enables organizations to programmatically detect and fix cloud infrastructure misconfigurations; Tenable.io WAS, which provides scanning for modern web applications; and Tenable.ep, an unified platform that helps organizations identify, assess, and accurately prioritize cyber risks across the entire attack surface. The company also offers Tenable.ad, a solution to secure Active Directory environments; Tenable.ot, an on-premises solution that provides threat detection and mitigation, asset tracking, vulnerability management, and configuration control capabilities to protect OT environments, including industrial networks; Tenable.sc, an on-premises solution that provides a risk-based view of an organization's IT, security and compliance posture. In addition, it provides Nessus Professional, a vulnerability assessment solution for identifying security vulnerabilities, configuration issues, and malware; and Nessus Essentials, which includes vulnerability and configuration assessment for a limited number of assets. The company was founded in 2002 and is headquartered in Columbia, Maryland.",
      "market_cap": 5924826624,
      "dividend_yield": null
    },
    "roce": -5.460318954371406,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-41768000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-4176800016170000"
    },
    "high_low": {
      "high": 57.70000076293945,
      "low": 55.56999969482422
    }
  },
  "Q2 HOLDINGS INC": {
    "details": {
      "summary": "Q2 Holdings, Inc. provides cloud-based digital banking solutions to regional and community financial institutions (RCFIs) in the United States. The company offers Q2 Consumer Banking, a browser-based digital banking solution and comprehensive financial institution branded digital banking capabilities; Q2 Small Business and Commercial, a mobile and tablet digital banking solution; Q2mobile Remote Deposit Capture, a partnered solution that allows remote check deposit capture. It also provides Q2 Sentinel, a security analytics solution; Q2 Patrol, an event-driven validation product; Q2 SMART, a targeting and messaging platform; and Q2 CardSwap that allows account holders receiving newly issued cards to automatically change their payment information. In addition, the company offers Q2 Gro, a digital account opening, and digital sales and marketing platform; Q2 Biller Direct, a bill payment solution; ClickSWITCH allows financial institutions to direct deposits to the end user. Centrix Dispute Tracking System, an electronic transaction dispute management solution; Centrix Payments I.Q. System, an ACH file monitoring and risk reporting solution; Centrix Exact/Transaction Management System, a fraud prevention tool; and Q2 Caliper Software Development Kit. Futher, it provides Q2 Contextual PFM, which allows end users to add external accounts and view them together with internal accounts on digital banking home page; Q2 Goals that enables end users to establish and save towards specific savings goals; Q2 Cloud Lending, a digital lending and leasing platform; PrecisionLender platform, a cloud-based, data-driven sales enablement, pricing, and portfolio management solution; and Q2 BaaS, a portfolio of open API financial services. The company was formerly known as CBG Holdings, Inc. and changed its name to Q2 Holdings, Inc. in March 2013. Q2 Holdings, Inc. was founded in 2004 and is headquartered in Austin, Texas.",
      "market_cap": 3584781312,
      "dividend_yield": null
    },
    "roce": -6.41044081181109,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-77995000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-7799500015600000"
    },
    "high_low": {
      "high": 110.16000366210938,
      "low": 107.27999877929688
    }
  },
  "SNOWFLAKE INC": {
    "details": {
      "summary": "Snowflake Inc. provides cloud-based data platform in the United States and internationally. The company's platform offers Data Cloud, an ecosystem that enables customers to consolidate data into a single source of truth to drive meaningful business insights, build data-driven applications, and share data. Its platform is used by various organizations of various sizes in a range of industries. The company was formerly known as Snowflake Computing, Inc. and changed its name to Snowflake Inc. in April 2019. Snowflake Inc. was incorporated in 2012 and is based in Bozeman, Montana.",
      "market_cap": 68258955264,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "ORACLE CORP": {
    "details": {
      "summary": "Oracle Corporation provides products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning (ERP), Oracle Fusion cloud enterprise performance management, Oracle Fusion cloud supply chain and manufacturing management, Oracle Fusion cloud human capital management, Oracle Fusion cloud advertising and customer experience, and NetSuite applications suite. The company also offers cloud-based industry solutions for various industries; Oracle application licenses; and Oracle license support services. In addition, it provides cloud and license business' infrastructure technologies, such as the Oracle Database, an enterprise database; Java, a software development language; and middleware, including development tools and others. The company's cloud and license business' infrastructure technologies also comprise cloud-based compute, storage, and networking capabilities through its Oracle cloud infrastructure as a service offerings. Further, it offers infrastructure offerings comprising Oracle autonomous data warehouse cloud service, Oracle autonomous transaction processing cloud service, Internet-of-Things, digital assistant, and blockchain. Additionally, the company provides hardware products and other hardware-related software offerings, including Oracle engineered systems, enterprise servers, storage solutions, industry-specific hardware, virtualization software, operating systems, management software, and related hardware services; and consulting services. The company markets and sells its cloud, license, hardware, support, and services offerings directly to businesses in various industries, government agencies, and educational institutions, as well as through indirect channels. Oracle Corporation was founded in 1977 and is headquartered in Austin, Texas.",
      "market_cap": 218122354688,
      "dividend_yield": 0.0164
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "FORTINET INC": {
    "details": {
      "summary": "Fortinet, Inc. provides broad, integrated, and automated cybersecurity solutions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It offers FortiGate hardware and software licenses that provide various security and networking functions, including firewall, intrusion prevention, anti-malware, virtual private network, application control, web filtering, anti-spam, and wide area network acceleration. The company also provides FortiSwitch product family that offers secure switching solutions for connecting customers their end devices; FortiAP product family, which provides secure wireless networking solutions; FortiExtender, a hardware appliance; FortiAnalyzer product family, which offers centralized network logging, analyzing, and reporting solutions; and FortiManager product family that provides central and scalable management solution for its FortiGate products. It offers FortiWeb product family provides web application firewall solutions; FortiMail product family that secure email gateway solutions; FortiSandbox technology that delivers proactive detection and mitigation services; FortiClient that provides endpoint protection with pattern-based anti-malware, behavior-based exploit protection, web-filtering, and an application firewall; FortiToken and FortiAuthenticator product families for multi-factor authentication to safeguard systems, assets, and data; and FortiEDR/XDR, an endpoint protection solution that provides both comprehensive machine-learning anti-malware execution and real-time post-infection protection. It provides security subscription, technical support, professional, and training services. It sells its security solutions to channel partners and directly to various customers in telecommunications, technology, government, financial services, education, retail, manufacturing, and healthcare industries. It has strategic alliance with Linksys. Fortinet, Inc. was incorporated in 2000 and is headquartered in Sunnyvale, California.",
      "market_cap": 51455979520,
      "dividend_yield": null
    },
    "roce": 18.061649541793944,
    "ebit": {
      "2021-01-01SEP2021-12-31": "650400000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "65040000084400000"
    },
    "high_low": {
      "high": 371.7699890136719,
      "low": 362.7099914550781
    }
  },
  "CERENCE INC": {
    "details": {
      "summary": "Cerence Inc. provides AI powered virtual assistants for the mobility/transportation market worldwide. The company offers edge software components; cloud-connected components and related toolkits and applications; and virtual assistant coexistence and professional services. It also provides conversational artificial intelligence-based solutions, including speech recognition, natural language understanding, speech signal enhancement, text-to-speech, and acoustic modeling technology. Cerence Inc. is headquartered in Burlington, Massachusetts.",
      "market_cap": 1420964224,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "GTY TECHNOLOGY HOLDINGS": {
    "details": {
      "summary": "GTY Technology Holdings Inc. operates as a software-as-a-service (SaaS) company that offers a cloud-based suite of solutions for the public sector in North America. The company develops software technologies for the procurement and vendor or supplier sourcing industry in government, public sector, and various highly-regulated commercial vertical markets; and content, digital, and integrated payment services via a SaaS platform for government agencies and utility companies. It also provides cloud-based grants management and cost allocation software for state, local, and tribal governments; software to streamline municipal permissions and licenses; budgeting software, performance management, and transparency and data visualization solutions; and public sector budgeting SaaS, software, and consulting services. GTY Technology Holdings Inc. was incorporated in 2016 and is headquartered in Boston, Massachusetts.",
      "market_cap": 216892368,
      "dividend_yield": null
    },
    "roce": 1.6963546421519715,
    "ebit": {
      "2021-01-01SEP2021-12-31": "1598000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "1598000427000"
    },
    "high_low": {
      "high": 8.09000015258789,
      "low": 7.829999923706055
    }
  },
  "OBLONG INC": {
    "details": {
      "summary": "Oblong, Inc. provides multi-stream collaboration technologies and managed services for video collaboration and network applications in the United States and internationally. The company operates in two segments, Oblong and Oblong Industries. Its flagship product is Mezzanine that enables visual collaboration across multi-users, multi-screens, multi-devices, and multi-locations for video telepresence, laptop and application sharing, and whiteboard sharing and slides applications. The company also provides managed videoconferencing services; and remote service management, which provides an overlay to enterprise information technology and channel partner support organizations, as well as support and management services for customer video environments. In addition, it offers network services comprising Cloud Connect: Video that allows its customers to outsource the management of their video traffic to them and provides the customer's office locations with a secure, dedicated video network connection to the Oblong Cloud for video communications; Cloud Connect: Converge, which offers customized multiprotocol label switching solutions; and Cloud Connect: Cross Connect that allows the customer to leverage existing carrier for the extension of a Layer 2 private line to its data center. Further, it provides professional services, such as onsite support or dispatch, as well as configuration or customization of equipment or software on behalf of customers; and resells video equipment to its customers. It serves customers in the enterprise, commercial, and public sector markets. The company is headquartered in Los Angeles, California.",
      "market_cap": 18181440,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "ASPEN TECHNOLOGY INC": {
    "details": {
      "summary": "Aspen Technology, Inc., together with its subsidiaries, provides asset optimization solutions in North America, Europe, the Asia Pacific, Latin America, and the Middle East. The company operates in two segments, Subscription and Software, and Services and Other. It offers asset optimization software that optimizes asset design, operations, and maintenance in various industrial environments. The company's software suites include aspenONE Engineering, aspenONE Manufacturing and Supply Chain, and aspenONE Asset Performance that are integrated applications, which allow end users to design process manufacturing environments, monitor operational performances, respond and adapt to operational changes, predict asset reliability and equipment failure, and manage planning and scheduling activities, as well as collaborate across these functions and activities. It also provides software maintenance and support, professional, and training services. The company's customers comprise companies that are engaged in the process and other capital-intensive industries, such as energy, chemicals, engineering, and construction, as well as pharmaceuticals, food and beverage, transportation, power, metals and mining, pulp and paper, and consumer packaged goods. Aspen Technology, Inc. was founded in 1981 and is headquartered in Bedford, Massachusetts.",
      "market_cap": 9741984768,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "EBIX INC": {
    "details": {
      "summary": "Ebix, Inc., together with its subsidiaries, provides on-demand infrastructure software exchanges and e-commerce services to the insurance, financial, travel, and healthcare industries in the United States and internationally. It develops and deploys insurance and reinsurance exchanges; provides software-as-a-service (SaaS) enterprise solutions in the areas of customer relationship management, and front-end and back-end systems; and offers outsourced administrative and risk compliance solutions. The company operates P&C exchanges primarily in Australia, New Zealand, the United Kingdom, and the United States, which facilitates the exchange of insurance data between brokers and insurance carriers with a focus on the areas of personal and commercial lines. Its exchange related products and services include travel exchanges and money transfer services; foreign exchange and outward remittance services; payment services; gift cards for consumers that can be redeemed at various merchants; and technology services for various providers in the areas of lending, wealth and asset management, and travel. The company's insurance exchanges related products and services include SaaS platform and related services; licensing of software; and professional services comprising setting up, customization, training, or consulting. Its risk compliance services cover certificates of insurance creation and tracking; consulting services comprising project management and development; and business process outsourcing services, including domain intensive project management, system consulting services, and claims adjudication/settlement services. The company was formerly known as Delphi Systems, Inc. and changed its name to Ebix, Inc. in December 2003. Ebix, Inc. was founded in 1976 and is headquartered in Johns Creek, Georgia.",
      "market_cap": 1205628160,
      "dividend_yield": 0.0077
    },
    "roce": 8.699218013324035,
    "ebit": {
      "2021-01-01SEP2021-12-31": "119010000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "11901000015178000"
    },
    "high_low": {
      "high": 44.41999816894531,
      "low": 38.470001220703125
    }
  },
  "SYNCHRONOSS TECHNOLOGIES": {
    "details": {
      "summary": "Synchronoss Technologies, Inc. provides cloud, messaging, digital, and network management platforms, products, and solutions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company's platforms, products, and solutions include content backup, view, manage, engage, transfer, and restore solutions in operating systems and devices; multi-channel messaging, peer-to-peer communications, and application-to-person commerce solutions; email solutions; customer journey and workflow design, development, orchestration, and experience management solutions; and telecom network infrastructure designing, procuring, managing, and optimizing solutions. It also streamlines the activation of new services and devices. In addition, the company offers software development and customization services. It markets and sells its services through direct sales force and strategic partners. The company was incorporated in 2000 and is headquartered in Bridgewater, New Jersey.",
      "market_cap": 161663840,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "UPLAND SOFTWARE INC": {
    "details": {
      "summary": "Upland Software, Inc. provides cloud-based enterprise work management software in the United States, the United Kingdom, Canada, and internationally. It offers a family of software applications under the Upland brand in the areas of marketing, sales, contact center, project management, information technology, business operations, and human resources and legal. The company also provides professional services, such as implementation, data extraction, integration and configuration, and training services, as well as customer support services. It serves large global corporations, various government agencies, and small and medium-sized businesses, as well as financial, consulting, technology, manufacturing, media, telecommunication, political, healthcare, life sciences, retail and hospitality, and non-profit industries through direct and indirect sales organizations. The company was formerly known as Silverback Enterprise Group, Inc. and changed its name to Upland Software, Inc. in November 2013. Upland Software, Inc. was incorporated in 2010 and is headquartered in Austin, Texas.",
      "market_cap": 540460224,
      "dividend_yield": null
    },
    "roce": -3.9741543017524235,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-34677000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-3467700052928000"
    },
    "high_low": {
      "high": 53.0,
      "low": 50.310001373291016
    }
  },
  "SOLARWINDS CORP": {
    "details": {
      "summary": "SolarWinds Corporation provides information technology (IT) management software products in the United States and internationally. The company offers a portfolio of solutions to technology professionals for monitoring, managing, and optimizing networks, systems, desktops, applications, storage, databases, website infrastructures, and IT service desks. It provides a suite of network management software that offers real-time visibility into network utilization and bandwidth, as well as the ability to detect, diagnose, and resolve network performance problems; and a suite of infrastructure management products, which monitor and analyze the performance of applications and their supporting infrastructure, including websites, servers, physical, virtual and cloud infrastructure, storage, and databases. The company also provides a suite of application performance management software that enable visibility into log data, cloud infrastructure metrics, applications, tracing, and web performance management; and service management software that offers ITIL-compliant service desk solutions for various companies. It markets and sells its products directly to network and systems engineers, database administrators, storage administrators, DevOps, SecOps, and service desk professionals. The company was formerly known as SolarWinds Parent, Inc. and changed its name to SolarWinds Corporation in May 2018. SolarWinds Corporation was founded in 1999 and is headquartered in Austin, Texas.",
      "market_cap": 1949781120,
      "dividend_yield": null
    },
    "roce": -0.7507794210015417,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-32871000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-32871000230135000"
    },
    "high_low": {
      "high": 23.0,
      "low": 22.360000610351562
    }
  },
  "NUANCE COMMUNICATIONS INC": {
    "details": {
      "summary": "Nuance Communications, Inc. provides conversational and cognitive artificial intelligence (AI) innovations that bring intelligence to everyday work and life. The company delivers solutions that understand, analyze, and respond to people - amplifying human intelligence to increase productivity and security. Its Healthcare segment provides clinical speech and clinical language understanding solutions that improve the clinical documentation process, from capturing the complete patient record to improving clinical documentation and quality measures for reimbursement. Its solutions include Dragon Medical One, cloud-based speech solution; computer-assisted physician documentation; diagnostic imaging solutions; Nuance Dragon Ambient eXperience, a voice-enabled solution; and clinical documentation improvement and coding. The company's Enterprise segment primarily engages in using speech, natural language understanding, and artificial intelligence to provide automated customer solutions and services for voice, mobile, web, and messaging channels. Its solutions include intelligent engagement solutions; Conversational AI; Engagement AI; and Security AI. Its Other segment provides voicemail transcription services. It serves organizations across healthcare, financial services, telecommunications, government, and retail. The company markets and sells its solutions and technologies directly through sales force, as well as through a network of resellers, including system integrators, independent software vendors, value-added resellers, distributors, hardware vendors, telecommunications carriers, and e-commerce Websites worldwide. The company was formerly known as ScanSoft, Inc. and changed its name to Nuance Communications, Inc. in October 2005. Nuance Communications, Inc. was incorporated in 1992 and is headquartered in Burlington, Massachusetts. As of March 4, 2022, Nuance Communications, Inc. operates as a subsidiary of Microsoft Corporation.",
      "market_cap": 17882421248,
      "dividend_yield": null
    },
    "roce": 3.3648808284085288,
    "ebit": {
      "2020-10-01SEP2021-09-30": "82719000"
    },
    "ebitda": {
      "2020-10-01SEP2021-09-30": "827190005000000"
    },
    "high_low": {
      "high": 56.0,
      "low": 55.9900016784668
    }
  },
  "SHOTSPOTTER INC": {
    "details": {
      "summary": "ShotSpotter, Inc. provides precision-policing and security solutions for law enforcement and security personnel in the United States, South Africa, and the Bahamas. Its solutions include ShotSpotter Respond, a public safety solution, which serves cities and municipalities to identify, locate, and deter gun violence by incorporating a real-time gunshot detection system into their policing systems; and ShotSpotter Connect, a patrol management software to help plan directed patrols and tactics for crime deterrence. The company also provides ShotSpotter SecureCampus and ShotSpotter SiteSecure that helps the law enforcement and security personnel serving universities, corporate campuses, big-box retail, malls, and key infrastructure or transportation centers to mitigate risk and enhance security by notifying authorities of a outdoor gunfire incident and saving minutes for first responders to arrive. In addition, it offers ShotSpotter Investigate, a cloud-based investigative platform to help law enforcement agencies modernize every phase of an investigation and accelerate case work with easy-to-use software tools. Further, it provides ShotSpotter Labs, a technology to adapt and extend commercial technology to address significant wildlife and environmental issues. The company sells its solutions through its direct sales teams. ShotSpotter, Inc. was founded in 1996 and is headquartered in Newark, California.",
      "market_cap": 324590016,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "ZENDESK INC": {
    "details": {
      "summary": "Zendesk, Inc., a software development company, provides software as a service solutions for organizations in the United States, Europe, the Middle East, Africa, the Asia Pacific, and internationally. Its flagship product is Zendesk Support, a system for tracking, prioritizing, and solving customer support tickets across various channels. The company also offers Zendesk Chat, a live chat and messaging software to connect with customers on websites and mobile devices applications; Zendesk Talk, a cloud-based call center software; Zendesk Guide, a knowledge base that powers customer self-service and support agent productivity; Zendesk Gatherf, a community forum software that allows customer end-users to connect and collaborate; Zendesk Explore, which provides analytics for organizations to measure and enhance the customer experience; and Zendesk Sell, a sales customer relationship management (CRM) product solution to enhance productivity, processes, and pipeline visibility. In addition, it provides Zendesk Sunshine, a CRM platform; Sunshine Conversations, a messaging platform solution; Zendesk Developer Tools, a combination of application programming interfaces, web widget, and mobile software development kits; Zendesk APIs that allow users to build custom integrations and interact with Zendesk data; and Zendesk Apps that enable organizations to customize Zendesk product and platform solution interfaces and optimize workflow through plug-ins, as well as Zendesk Suite, an omnichannel offering, which combines its solutions. The company was founded in 2007 and is headquartered in San Francisco, California.",
      "market_cap": 14208589824,
      "dividend_yield": null
    },
    "roce": -10.824058080184942,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-166684000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-16668400037610000"
    },
    "high_low": {
      "high": 155.6199951171875,
      "low": 151.9149932861328
    }
  },
  "AUDIOEYE INC": {
    "details": {
      "summary": "AudioEye, Inc. provides patented, internet content publication, distribution software, and related services to Internet, print, broadcast, and other media to people regardless of their network connection, device, location, or disabilities in the United States. Its software and services enable conversion of digital content into accessible formats and allows for real time distribution to end users on any Internet connected device. The company offers AudioEye, an always-on testing, remediation, and monitoring solution that improves conformance with web content accessibility guidelines; identifies and fixes the common accessibility errors and addresses a range of disabilities including dyslexia, color blindness, epilepsy, and others; and provides additional solutions to provide for enhanced compliance and accessibility, including periodic manual auditing, manual remediations, and legal support services, as well as PDF remediation services and audit reports to help customers with their digital accessibility needs. The company serves small- and medium-sized businesses, corporate enterprises, non-profit organizations, and federal government agencies, as well as federal, state, and local governments and agencies through content management system partners, platform and agency partners, authorized resellers, and the marketplace. AudioEye, Inc. was incorporated in 2005 and is based in Tucson, Arizona.",
      "market_cap": 86448600,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "ASANA INC": {
    "details": {
      "summary": "Asana, Inc., together with its subsidiaries, operates a work management platform for individuals, team leads, and executives in the United States and internationally. It provides a work management platform as software as service that enables individuals and teams to get work done faster while enhancing employee engagement by allowing everyone to see how their work connects to the mission of an organization. The company was formerly known as Smiley Abstractions, Inc. and changed its name to Asana, Inc. in July 2009. Asana, Inc. was incorporated in 2008 and is headquartered in San Francisco, California.",
      "market_cap": 8420298240,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "ONESPAN INC": {
    "details": {
      "summary": "OneSpan Inc., together with its subsidiaries, designs, develops, and markets digital solutions for identity, security, and business productivity worldwide. The company offers OneSpan Sign, a range of e-signature requirements for occasional agreement to processing tens of thousands of transactions; OneSpan Cloud Authentication, a cloud-based multifactor authentication solution that supports a range of authentication options, including biometrics, push notification, and visual cryptograms for transaction data signing, SMS, and hardware authenticators; and OneSpan Identity Verification, which enables banks and financial institutions identity verification services. It also provides Mobile Security Suite, a software development kit; Mobile Authenticator Studio, a mobile authenticator that operates as a discrete mobile application; and authentication servers, which enables customers to administer a high level of access control. In addition, it offers Trusted Identity Platform, a cloud platform that simplify and secure user journeys; Intelligent Adaptive Authentication; and Risk Analytics, a comprehensive anti-fraud solution. It sells its solutions through its direct sales force, as well as through distributors, resellers, systems integrators, and original equipment manufacturers. The company was formerly known as VASCO Data Security International, Inc. and changed its name to OneSpan Inc. in May 2018. OneSpan Inc. was founded in 1991 and is headquartered in Chicago, Illinois.",
      "market_cap": 543619008,
      "dividend_yield": null
    },
    "roce": -10.319319101878,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-26128000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-261280008926000"
    },
    "high_low": {
      "high": 29.170000076293945,
      "low": 28.1200008392334
    }
  },
  "PARK CITY GROUP INC": {
    "details": {
      "summary": "Park City Group, Inc., a software-as-a-service provider, designs, develops, and markets proprietary software products in North America. The company offers ReposiTrak MarketPlace, a supplier discovery and B2B e-commerce solution; ReposiTrak Compliance and Food Safety solutions, which reduces potential regulatory and legal risk from their supply chain partners; and ReposiTrak Supply Chain solutions that enables customers to manage relationships with suppliers. It also provides ScoreTracker, Vendor Managed Inventory, Store Level Ordering and Replenishment, Enterprise Supply Chain Planning, Fresh Market Manager, and ActionManager supply chain solutions to manage inventory, product mix, and labor. In addition, the company offers business-consulting services to suppliers and retailers in the grocery, convenience store, and specialty retail industries, as well as professional consulting services. It primarily serves multi-store retail chains, wholesalers and distributors, and their suppliers. The company is headquartered in Murray, Utah.",
      "market_cap": 111123072,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "AGILYSYS INC": {
    "details": {
      "summary": "Agilysys, Inc., together with its subsidiaries, operates as a developer and marketer of hardware and software products and services to the hospitality industry in North America, Europe, the Asia-Pacific, and India. It offers point of sale, property management systems, payment, inventory and procurement, reservations and venue management, activity management, document management, and analytics and marketing loyalty solutions to enhance guest experience. The company also provides technical software support, maintenance, and subscription services; and professional services. It offers its solutions for gaming, hotels, resorts and cruise, corporate foodservice management, restaurants, universities, stadia, and healthcare. The company was formerly known as Pioneer-Standard Electronics, Inc. and changed its name to Agilysys, Inc. in 2003. Agilysys, Inc. was founded in 1963 and is headquartered in Alpharetta, Georgia.",
      "market_cap": 1035281984,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "CYREN LTD": {
    "details": {
      "summary": "Cyren Ltd., together with its subsidiaries, develops and markets information security solutions for protecting Web, email, and mobile transactions in the United States, Germany, other European countries, the Asia Pacific, Israel, and internationally. It offers software-as-a-service (SaaS) cybersecurity solutions that protect businesses, their employees, and customers from email, files, and the web threats. The company provides Cyren threat detection services, which include email security engine that offers anti-spam inbound and outbound, IP reputation, and virus outbreak detection services; malware detection engine that is used to protect email applications; Web security engine that is used by customers to provide URL classification for web browser filtering and safe search capabilities; and threat analysis services to detect advanced cyber threats. It also provides Cyren threat intelligence data products, which include real-time phishing intelligence, malware file intelligence, IP reputation intelligence, malware URL intelligence, and Zombie host intelligence for threat detection, threat hunting, and incident response. In addition, the company offers Cyren enterprise email security products, including Cyren Email Security, a cloud-based secure email gateway; Cyren Inbox Security, an anti-phishing and remediation product for Microsoft 365; and Cyren Threat InDepth, a threat intelligence that allows enterprise security teams and executives to gain a view of evolving email-borne threats and make decisions to mitigate them. It sells its products through direct and indirect channels, including distributors, value added resellers, and managed service providers to enterprise customers and original equipment manufacturers. The company was formerly known as Commtouch Software Ltd. and changed its name to Cyren Ltd. in January 2014. Cyren Ltd. was incorporated in 1991 and is based in Herzliya, Israel.",
      "market_cap": 33562060,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "CLOUDFLARE INC": {
    "details": {
      "summary": "CloudFlare, Inc. operates as a cloud services provider that delivers a range of services to businesses worldwide. The company offers an integrated cloud-based security solution to secure a range of combination of platforms, including public cloud, private cloud, on-premise, software-as-a-service applications, and IoT devices. Its security products comprise cloud firewall, bot management, distributed denial of service, IoT, SSL/TLS, secure origin connection, and rate limiting products. The company also offers performance solutions, which include content delivery and intelligent routing, as well as content, mobile, and image optimization solutions. In addition, it provides reliability solutions comprising load balancing, anycast network, virtual backbone, DNS, DNS resolver, online, and virtual waiting room solutions. Further, the company offers Cloudflare internal infrastructure solutions, including on-ramps, which connect users, devices, or locations to its network; and filters, which are the products that protect, inspect, and privilege data. Additionally, it provides developer-based solutions, such as serverless computing/programmable network, website development, domain registration, Cloudflare apps, analytics, and data localization management; Consumer DNS Resolver, a consumer app to browse the Internet; and Consumer VPN for consumers to secure and accelerate traffic on mobile devices. The company serves customers in the technology, healthcare, financial services, consumer and retail, and non-profit industries, as well as government. CloudFlare, Inc. was incorporated in 2009 and is headquartered in San Francisco, California.",
      "market_cap": 35596505088,
      "dividend_yield": null
    },
    "roce": -6.1283240844998765,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-127684000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-12768400066607000"
    },
    "high_low": {
      "high": 221.63999938964844,
      "low": 210.94000244140625
    }
  },
  "CADENCE DESIGN SYSTEMS INC": {
    "details": {
      "summary": "Cadence Design Systems, Inc. provides software, hardware, services, and reusable integrated circuit (IC) design blocks worldwide. The company offers functional verification services, including emulation and prototyping hardware. Its functional verification offering consists of JasperGold, a formal verification platform; Xcelium, a parallel logic simulation platform; Palladium, an enterprise emulation platform; and Protium, a prototyping platform for chip verification. The company also provides digital IC design and sign off products, including Genus logic synthesis and Joules RTL power solutions, as well as Modus software solution to reduce systems-on-chip design-for-test time; physical implementation tools, such as place and route, optimization, and multiple patterning preparation; and signoff products to signoff the design as ready for silicon manufacturing. In addition, it offers custom IC design and simulation products to create schematic and physical representations of circuits down to the transistor level for analog, mixed-signal, custom digital, memory, and radio frequency designs; and system design and analysis products to develop printed circuit boards and IC packages, as well as to analyze electromagnetic, electro-thermal, and other multi-physics effects. Further, the company provides intellectual property (IP) products comprising pre-verified and customizable functional blocks to integrate into customer's ICs; and verification IP and memory models to emulate and model the expected behavior and interaction of standard industry system interface protocols. Additionally, it offers services related to methodology, education, and hosted design solutions, as well as technical support and maintenance services. The company serves 5G communications, aerospace and defense, automotive, industrial and healthcare, mobile, consumer, and hyperscale computing markets. Cadence Design Systems, Inc. was incorporated in 1987 and is headquartered in San Jose, California.",
      "market_cap": 44060368896,
      "dividend_yield": null
    },
    "roce": 22.81323918603228,
    "ebit": {
      "2021-01-03SEP2022-01-01": "779089000"
    },
    "ebitda": {
      "2021-01-03SEP2022-01-01": "779089000142308000"
    },
    "high_low": {
      "high": 192.6999969482422,
      "low": 189.32000732421875
    }
  },
  "PING IDENTITY HOLDING CORP": {
    "details": {
      "summary": "Ping Identity Holding Corp., doing business as Ping Identity Corporation, offers intelligent identity solutions for the enterprise in the United States and internationally. Its Ping Intelligent Identity platform provides access to cloud, mobile, Software-as-a-Service, and on-premise applications with customers, workforce, and partners. The company's platform offers secure single sign-on; multi-factor authentication; access security; directory solution; dynamic authorization; risk management; identity verification; API intelligence; orchestration; and fraud detection. It also provides professional and customer support services. The company sells its solutions through a direct sales force. Its customers include enterprises in Fortune 100, U.S. banks, healthcare companies, aerospace companies, auto manufacturers, and North American retailers. The company was formerly known as Roaring Fork Holding, Inc. and changed its name to Ping Identity Holding Corp. in August 2019. Ping Identity Holding Corp. was incorporated in 2016 and is headquartered in Denver, Colorado.",
      "market_cap": 1948862208,
      "dividend_yield": null
    },
    "roce": -12.748126698876423,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-79025000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-7902500044384000"
    },
    "high_low": {
      "high": 30.25,
      "low": 28.270000457763672
    }
  },
  "JAMF HOLDING CORP": {
    "details": {
      "summary": "Jamf Holding Corp. offers a cloud software platform for Apple infrastructure and security platform worldwide. Its products include Jamf Pro, an Apple ecosystem management software solution for IT environments; Jamf Now, a pay-as-you-go Apple device management software solution for small-to-medium-sized businesses; Jamf School, a software solution for educators; Jamf Data Policy, a solution to enforce acceptable usage policies to eliminate shadow IT and block risky content and manage data consumption with real-time analytics and granular reporting; and Jamf Connect that streamlines Mac authentication and identity management; and Jamf Private Access, a ZTNA solution that replaces legacy conditional access and VPN technology. The company also offers Jamf Protect, which provides protection of Mac-targeted malware and creates customized telemetry and detections that give enterprise security teams visibility into their Macs; Jamf Threat Defense, a solution to protect workers from malicious attackers; and Jamf Nation, an online community of IT and security professionals focusing on Apple in the enterprise. It sells its SaaS solutions through a subscription model, direct sales force, and online, as well as indirectly through channel partners, including Apple. The company was founded in 2002 and is headquartered in Minneapolis, Minnesota.",
      "market_cap": 4276288000,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "ADOBE INC": {
    "details": {
      "summary": "Adobe Inc. operates as a diversified software company worldwide. It operates through three segments: Digital Media, Digital Experience, and Publishing and Advertising. The Digital Media segment offers products, services, and solutions that enable individuals, teams, and enterprises to create, publish, and promote content; and Document Cloud, a unified cloud-based document services platform. Its flagship product is Creative Cloud, a subscription service that allows members to access its creative products. This segment serves content creators, workers, marketers, educators, enthusiasts, communicators, and consumers. The Digital Experience segment provides an integrated platform and set of applications and services that enable brands and businesses to create, manage, execute, measure, monetize, and optimize customer experiences from analytics to commerce. This segment serves marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers, and executives across the C-suite. The Publishing and Advertising segment offers products and services, such as e-learning solutions, technical document publishing, web conferencing, document and forms platform, web application development, and high-end printing, as well as Advertising Cloud offerings. The company offers its products and services directly to enterprise customers through its sales force and local field offices, as well as to end users through app stores and through its website at adobe.com. It also distributes products and services through a network of distributors, value-added resellers, systems integrators, software vendors and developers, retailers, and original equipment manufacturers. The company was formerly known as Adobe Systems Incorporated and changed its name to Adobe Inc. in October 2018. Adobe Inc. was founded in 1982 and is headquartered in San Jose, California.",
      "market_cap": 214130868224,
      "dividend_yield": null
    },
    "roce": 28.568614899798117,
    "ebit": {
      "2020-11-28SEP2021-12-03": "5802000000"
    },
    "ebitda": {
      "2020-11-28SEP2021-12-03": "5802000000788000000"
    },
    "high_low": {
      "high": 699.5399780273438,
      "low": 678.9099731445312
    }
  },
  "SECUREWORKS CORP": {
    "details": {
      "summary": "SecureWorks Corp., through its subsidiaries, provides technology-driven information security solutions for protecting its customers in the United States and internationally. The company's solutions include software-as-a-service solutions, managed security services, and professional services, including incident response and security risk consulting services. Its solutions enable organizations to prevent security breaches, detect malicious activity, respond rapidly to security breaches, and identify emerging threats. The company sells its solutions primarily through its direct sales organization, as well as through referral agents, regional value-added resellers, and trade associations. It serves customers in a range of industries, including financial services, manufacturing, technology, retail, insurance, utility, and healthcare sectors. The company was formerly known as SecureWorks Holding Corporation and changed its name to SecureWorks Corp. in November 2015. SecureWorks Corp. was founded in 1999 and is headquartered in Atlanta, Georgia. SecureWorks Corp. is a subsidiary of Dell Inc.",
      "market_cap": 895069376,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "TERADATA CORP": {
    "details": {
      "summary": "Teradata Corporation, together with its subsidiaries, operates as a hybrid cloud analytics software provider. Its solutions and services comprise software, hardware, and related business consulting and support services to deliver analytics in company's analytical ecosystem. The company offers Teradata Vantage, a data warehouse and analytics platform. Its business consulting services include consulting services for organizations to establish an analytic vision, identify and operationalize analytical opportunities, enable an analytical ecosystem architecture, and ensure their analytical infrastructure delivers value, as well as support and maintenance services. The company serves various industries comprising financial services, government, healthcare, manufacturing, retail, telecommunications, and travel/transportation. It operates in the Americas; Europe, the Middle East and Africa; and the Asia Pacific and Japan. The company primarily sells and markets its solutions and services through a direct sales force. Teradata Corporation was incorporated in 1979 and is headquartered in San Diego, California.",
      "market_cap": 5245975040,
      "dividend_yield": null
    },
    "roce": 20.33450704225352,
    "ebit": {
      "2021-01-01SEP2021-12-31": "231000000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "231000000149000000"
    },
    "high_low": {
      "high": 59.380001068115234,
      "low": 58.11000061035156
    }
  },
  "REALNETWORKS INC": {
    "details": {
      "summary": "RealNetworks, Inc. provides digital media software and services in the United States, Europe, and internationally. Its Consumer Media segment offers RealPlayer media player, a software that enables consumers to discover, play, download, manage, and edit digital video, stream audio and video, download and save photos and videos from the web, transfer and share content on social networks, and edit their own photo and video content. This segment also licenses its codec technology to electronic equipment, microchip, and integrated circuit manufacturers. The company's Mobile Services segment provides digital media services to mobile and online service providers as software as a service offerings, which include intercarrier messaging services; Kontxt, a text message management, anti-spam, and classification product; ringback tone that enables callers to hear subscriber-selected music or messages; business intelligence, and subscriber management and billing for the carriers; RealTimes, a photo and video sharing platform that offers to wireless carriers for integration in their hosted cloud solutions; and SAFR, a computer vision platform. Its Games segment develops, publishes, and distributes casual games, including time-management, board, card, puzzle, word, and hidden-object games. It offers its casual games through mobile devices, digital downloads, and subscription play. RealNetworks, Inc. provides its products and services through direct and indirect channels comprising public relations, trade shows, events, and speaking opportunities; online channels, including social media; third party distribution partners; and third-party distribution channels, such as application storefronts, search engines, online portals, and content publishers. It offers its software and services to consumers, mobile carriers, device manufacturers, system integrators, and other businesses. The company was incorporated in 1994 and is headquartered in Seattle, Washington.",
      "market_cap": 27712676,
      "dividend_yield": null
    },
    "roce": -27.816250245917768,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-14139000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-14139000749000"
    },
    "high_low": {
      "high": 6.619999885559082,
      "low": 5.949999809265137
    }
  },
  "DROPBOX INC": {
    "details": {
      "summary": "Dropbox, Inc. provides a collaboration platform worldwide. Its platform allows individuals, teams, and organizations to collaborate and sign up for free through its website or app, as well as upgrade to a paid subscription plan for premium features. As of December 31, 2020, the company had approximately 700 million registered users across 180 countries. The company was formerly known as Evenflow, Inc. and changed its name to Dropbox, Inc. in October 2009. Dropbox, Inc. was incorporated in 2007 and is headquartered in San Francisco, California.",
      "market_cap": 8812109824,
      "dividend_yield": null
    },
    "roce": 14.325241451318194,
    "ebit": {
      "2021-01-01SEP2021-12-31": "274400000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "274400000151400000"
    },
    "high_low": {
      "high": 33.0,
      "low": 32.189998626708984
    }
  },
  "PAYCHEX INC": {
    "details": {
      "summary": "Paychex, Inc. provides integrated human capital management solutions for human resources (HR), payroll, benefits, and insurance services for small to medium-sized businesses in the United States and Europe. The company offers payroll processing services; payroll tax administration services; employee payment services; and regulatory compliance services, such as new-hire reporting and garnishment processing. It also provides HR solutions, including payroll, employer compliance, HR and employee benefits administration, risk management outsourcing, and the on-site availability of a professionally trained HR representative; and retirement services administration, including plan implementation, ongoing compliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services. In addition, the company offers cloud-based HR administration software products for employee benefits management and administration, time and attendance, digital communication solutions, recruiting, and onboarding solutions; plan administration outsourcing and state unemployment insurance services; various business services to small to medium-sized businesses comprising payroll funding and outsourcing services, which include payroll processing, invoicing, and tax preparation; and payment processing services, financial fitness programs, and a small-business loan resource center. Further, it provides insurance services for property and casualty coverage, such as workers' compensation, business-owner policies, cyber security protection, and commercial auto, as well as health and benefits coverage, including health, dental, vision, and life. The company markets and sells its services primarily through its direct sales force. Paychex, Inc. was founded in 1971 and is headquartered in Rochester, New York.",
      "market_cap": 46223794176,
      "dividend_yield": 0.019700000000000002
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "ZIX CORP": {
    "details": {
      "summary": "Vuzix Corporation designs, manufactures, markets, and sells augmented reality (AR) wearable display and computing devices for consumer and enterprise markets in North America, the Asia-Pacific, Europe, and internationally. It provides M300XL, M400, and M4000 series of smart glasses for enterprise, industrial, commercial, and medical markets; Vuzix Blade smart glasses; waveguide optics and related coupling optics; and other AR products, such as binocular next generation smart glasses and AR smart glasses product with 3D, stereo cameras, and 3D camera vision, as well as custom and engineering solutions. The company sells its products through resellers, direct to commercial customers, and via online stores, as well as various Vuzix operated web stores. It has a collaboration agreement with AmbiFi. The company was formerly known as Icuiti Corporation and changed its name to Vuzix Corporation in September 2007. Vuzix Corporation was founded in 1997 and is headquartered in West Henrietta, New York.",
      "market_cap": 443512928,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "CDK GLOBAL INC": {
    "details": {
      "summary": "CDK Global, Inc., together with its subsidiaries, provides integrated data and technology solutions to the automotive, heavy truck, recreation, and heavy equipment industries in the United States and internationally. It offers subscription-based software and technology solutions to automotive retailers, as well as to retailers and manufacturers of heavy trucks, construction and agricultural equipment, motorcycles, boats, and other marine and recreational vehicles. The company's flagship Dealer Management System provides software solutions that facilitates the sale of new and used vehicles, consumer financing, repair and maintenance services, and vehicle and parts inventory management. It also provides a portfolio of layered software applications and services to address the needs of automotive retail workflows. In addition, the company offers data management and business intelligence solutions to automotive retailers and original equipment manufacturers through its Neuron intelligent data platform. Further, it offers professional services, custom programming, consulting, implementation, and training solutions, as well as customer support solutions. The company serves approximately 15,000 retail locations. CDK Global, Inc. was incorporated in 2014 and is headquartered in Hoffman Estates, Illinois.",
      "market_cap": 5619729408,
      "dividend_yield": 0.0143
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "YEXT INC": {
    "details": {
      "summary": "Yext, Inc. organizes business facts to provide answers to consumer questions in North America and internationally. It operates Yext platform, a cloud-based platform that allows its customers to provide answers to consumer questions, to control the facts about their businesses and the content of their landing pages, and to manage their consumer reviews through its Knowledge Network of approximately 200 maps, apps, search engines, intelligent GPS systems, digital assistants, vertical directories and social networks. The platform helps its customers to centralize, control and manage data fields, including store information, such as name, address, phone number and holiday hours; professional information, comprising of headshot, specialties, and education; job information, consisting of title and description; and FAQs and other informations. It serves the healthcare, retail, and financial services industries. The company was incorporated in 2006 and is headquartered in New York, New York.",
      "market_cap": 883277440,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "MODEL N INC": {
    "details": {
      "summary": "Model N, Inc. provides cloud revenue management solutions for life sciences and high-tech companies. The company offers Global Pricing Management, which minimizes price erosion of products; Global Tender Management that enhances revenue by enabling segmentation and targeting, optimal bid pricing, and post-award tracking; Provider Management, which minimizes rebate overpayments; Payer Management that minimizes revenue leakage and noncompliance of complex contracts; Government Pricing, which optimizes revenue, and reduces the risk of fines and other penalties; and Medicaid that enhances compliance with regulatory requirements and payments of rebate claims timely, as well as at correct rates for government medicaid programs. It also provides Deal Management, which increases deal conversion and pricing consistency; Deal Intelligence that controls price concessions and determines ideal prices; Channel Management, which provides manufacturers a view of inventory, as well as evaluate price protection and stock rotation, and matching available inventory to quotes; Market Development Fund Management that allows companies to streamline their MDF process and reduce revenue leakage; Rebates Management, which centralizes control of rebate programs; and Channel Data Management that automates the process of collection, cleansing, validation, and standardization of channel partner data, such as POS, inventory, and claims. In addition, the company offers implementation, managed, strategic, and customer support services. It primarily serves large and mid-sized organizations worldwide through its direct sales force. The company was incorporated in 1999 and is headquartered in San Mateo, California.",
      "market_cap": 924990272,
      "dividend_yield": null
    },
    "roce": -5.391817634318504,
    "ebit": {
      "2020-10-01SEP2021-09-30": "-14414000"
    },
    "ebitda": {
      "2020-10-01SEP2021-09-30": "-144140007972000"
    },
    "high_low": {
      "high": 42.7400016784668,
      "low": 41.810001373291016
    }
  },
  "ASURE SOFTWARE INC": {
    "details": {
      "summary": "Asure Software, Inc. provides cloud-based human capital management solutions the United States. It helps various small and mid-sized businesses to develop human capital to get to the next level, stay compliant, and allocate resources toward growth. The company's solutions include Asure Payroll & Tax, an integrated cloud-based solution automates regulations associated with payroll and taxes, including wages, benefits, overtime, garnishments, tips, direct deposits, and fair labor standard act, as well as federal, state, and local payroll taxes; Asure HR, a cloud-based functionality that handles HR complexities, such as employee self-service that enable employees to access information, pay history, and company documents; and Asure Time & Attendance that provides cost savings and ROI gains come in the form of strategic use of labor dollars and the elimination of time theft. It also provides HR services that offers services ranging from an online compliance library and on-demand call center for various HR questions to outsourced HR function. Asure Software, Inc. was incorporated in 1985 and is headquartered in Austin, Texas.",
      "market_cap": 130993360,
      "dividend_yield": null
    },
    "roce": -6.392607487314077,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-12812000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-1281200016246000"
    },
    "high_low": {
      "high": 9.9399995803833,
      "low": 9.640000343322754
    }
  },
  "CERIDIAN HCM HOLDING": {
    "details": {
      "summary": "Ceridian HCM Holding Inc., together with its subsidiaries, operates as a human capital management (HCM) software company in the United States, Canada, and internationally. The company offers Dayforce, a cloud HCM platform that provides human resources (HR), payroll, benefits, workforce management, and talent management functionality; and Powerpay, a cloud HR and payroll solution for the small business market. It also provides Bureau solutions for payroll and payroll-related services. The company sells its solutions through direct sales force and third-party channels. Ceridian HCM Holding Inc. was incorporated in 2013 and is headquartered in Minneapolis, Minnesota.",
      "market_cap": 10668835840,
      "dividend_yield": null
    },
    "roce": -1.0367082323394563,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-35500000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-3550000077500000"
    },
    "high_low": {
      "high": 130.3699951171875,
      "low": 127.7699966430664
    }
  },
  "COMMVAULT SYSTEMS INC": {
    "details": {
      "summary": "Commvault Systems, Inc. provides data protection and information management software applications and related services in the United States and internationally. The company offers Commvault Backup and Recovery, a backup and recovery solution; Commvault Disaster Recovery, an easy-to-use replication and disaster recovery solution; and Commvault Complete Data Protection, an easy-to-use data protection solution. It also provides Commvault Activate, a data insight solution; Commvault HyperScale X, an easy-to-deploy scale-out solution; Hedvig Distributed Storage Platform that offers software-defined storage built on a hyperscale architecture; Metallic Cloud Storage is the easy button to adopt secure and scalable cloud storage; and Metallic Backup-as-a-Service. In addition, the company provides technology and business consulting, education, and remote managed services. Further, it sells appliances that integrate the software with hardware for use in a range of business needs and use cases; and offers professional and customer support services. The company sells its products and services directly through its sales force to large enterprises, small and medium sized businesses, and government agencies, as well as indirectly through its network of distributors, value-added resellers, systems integrators, corporate resellers, and original equipment manufacturers. It supports customers in a range of industries, including banking, insurance and financial services, government, healthcare, pharmaceuticals and medical services, technology, legal, manufacturing, utilities, and energy. It has strategic relationships with Microsoft, Cisco, Dell EMC, Amazon Web Services, NetApp, Nutanix, Fujitsu, Google Cloud, Hitachi, Hewlett Packard Enterprise, IBM, Lenovo, OpenStack, Oracle, Pure Storage, Red Hat, Salesforce, SAP, ServiceNow, Splunk, Supermicro, VMware, and Meridian Group International. Commvault Systems, Inc. was founded in 1988 and is headquartered in Tinton Falls, New Jersey.",
      "market_cap": 3016316672,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "IDEANOMICS INC": {
    "details": {
      "summary": "Ideanomics, Inc. focuses on driving the adoption of commercial electric vehicles, associated energy consumption, and developing financial services and fintech products. Its Ideanomics Mobility division facilitates the adoption of electric vehicles by commercial fleet operators. This division also offers solutions for the procurement, financing, charging, and energy management needs for fleet operators of commercial electric vehicles. The company's Ideanomics Capital division provides fintech services, which focuses on the enhancement of efficiency, transparency, and profitability for the financial services industry. Ideanomics, Inc. was incorporated in 2004 and is headquartered in New York, New York.",
      "market_cap": 497083776,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "BENEFITFOCUS INC": {
    "details": {
      "summary": "Benefitfocus, Inc. provides cloud-based benefits management technology solutions for employers and health plans in the United States. Its products for employers comprise Benefitplace, a cloud-based benefits management portal that streamlines online enrollment, employee communication, and benefit administration; Health Insights, a data analytics solution; ACA Management and Reporting, a solution for employers to manage ACA compliance; Billing & Payments, an application that synchronizes enrollment and billing information to streamline the monthly billing process, automate adjustments, and enhance accuracy of payments; and COBRA Administration, a solution that simplifies management of Consolidated Omnibus Budget Reconciliation Act, benefits. The company's products for health plans include Enrollment that provides platform for carriers to automate enrollment across all segments of their commercial group business; Billing & Payments, an electronic invoice presentment and payment solution; Exchange, a solution that bridges the integration gap between health plan and employer systems; and Quoting that gives health plans and brokers tools to organize and proactively manage accounts, track leads, generate quotes, and create proposals for multiple products. Its products for brokers consist of Health Insights that support strategic decisions for their clients with on-demand health plan analytics; Benefit Catalog, which allows brokers to offer products to their clients; and benefit catalog consultative support for brokers through benefit advisors. The company also provides implementation services to its customers in order to help ensure seamless deployment and effective utilization of its solutions; and employers with expanded support services. The company was incorporated in 2000 and is headquartered in Charleston, South Carolina.",
      "market_cap": 368737312,
      "dividend_yield": null
    },
    "roce": -3.027491317833568,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-5710000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-571000014418000"
    },
    "high_low": {
      "high": 15.199999809265137,
      "low": 14.800000190734863
    }
  },
  "PROS HOLDINGS INC": {
    "details": {
      "summary": "PROS Holdings, Inc. provides solutions that optimize the processes of selling and shopping in the digital economy worldwide. The company offers PROS Smart Configure Price Quote that improves sales productivity and accelerate deal velocity by automating common sales tasks; and PROS Smart Price Optimization and Management that enables businesses to optimize, personalize and harmonize pricing across the complexity of their go-to-market channels in the context of dynamic market and competitive conditions. It offers PROS Airline Revenue Optimization; PROS Airline Revenue Management solution that delivers algorithmic forecasting and network optimization for the travel industry; PROS Airline Real-Time Dynamic Pricing that offers accurate booking class availability and seat prices; and PROS Airline Group Sales Optimizer which enables airlines and their travel agent partners to create and manage group bookings, contracts, and policies. Further, it provides PROS Digital Retail, a configurable end-to-end solution for airlines to optimize the traveler experience from inspiration to post-trip; and PROS digital offer marketing solutions provide performance content management and search engine marketing tools that enable businesses in the travel industry. Additionally, the company offers software-related services, such as implementation, configuration, consulting, training, and maintenance and support services. It sells its software solutions to customers in various industries, including automotive and industrial manufacturing, transportation and logistics, chemicals and energy, food and beverage, healthcare, high tech, and travel. The company markets and sells its software solutions through its sales force, as well as through partners, resellers, and systems integrators. PROS Holdings, Inc. was incorporated in 1985 and is headquartered in Houston, Texas.",
      "market_cap": 1470710272,
      "dividend_yield": null
    },
    "roce": -21.887862354042642,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-74343000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-7434300012060000"
    },
    "high_low": {
      "high": 50.900001525878906,
      "low": 49.88999938964844
    }
  },
  "JACK IN THE BOX INC": {
    "details": {
      "summary": "Jack in the Box Inc. operates and franchises Jack in the Box quick-service restaurants. As of November 23, 2021, it operated and franchised approximately 2,200 Jack in the Box quick-service restaurants in 21 states and Guam. The company was founded in 1951 and is headquartered in San Diego, California.",
      "market_cap": 1912639616,
      "dividend_yield": 0.0219
    },
    "roce": 20.40334367529842,
    "ebit": {
      "2020-09-28SEP2021-10-03": "289946000"
    },
    "ebitda": {
      "2020-09-28SEP2021-10-03": "28994600046500000"
    },
    "high_low": {
      "high": 124.52999877929688,
      "low": 122.12999725341797
    }
  },
  "ENVESTNET INC": {
    "details": {
      "summary": "Envestnet, Inc., together with its subsidiaries, provides wealth management software and services in the United States and internationally. It operates through Envestnet Wealth Solutions and Envestnet Data & Analytics segments. The company's product and services include Envestnet | Enterprise, which provides an end-to-end open architecture wealth management platform, as well as offers data aggregation and reporting, data analytics, and digital advice capabilities; Envestnet | Tamarac that provides trading, rebalancing, portfolio accounting, performance reporting, and client relationship management software; and Envestnet | MoneyGuide that provides goals-based financial planning solutions to the financial services industry. It also provides Envestnet | Retirement Solutions, which offer a suite of services for advisor-sold retirement plans; and Envestnet | Portfolio Management Consultants that provide research and consulting services to assist advisors in creating investment solutions for their clients, and portfolio overlay and tax optimization services, as well as data aggregation and data intelligence platform, which offers cloud-based innovation for digital financial services. The company primarily serves banks, wealth management and brokerage firms, internet services companies, and registered investment advisers. Envestnet, Inc. was founded in 1999 and is headquartered in Chicago, Illinois.",
      "market_cap": 4169906432,
      "dividend_yield": null
    },
    "roce": 0.4062871588876565,
    "ebit": {
      "2021-01-01SEP2021-12-31": "2033000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "203300027694000"
    },
    "high_low": {
      "high": 85.98999786376953,
      "low": 85.0
    }
  },
  "CITRIX SYSTEMS INC": {
    "details": {
      "summary": "Citrix Systems, Inc., an enterprise software company, provides workspace, app delivery and security, and professional services worldwide. The company offers workspace services, including Citrix Workspace; Citrix Virtual Apps and Desktops; Collaborative Work Management; Citrix Content Collaboration, a cloud-based file sharing, digital transaction, and storage solution, which provides enterprise-class data services on various corporate and personal mobile devices; Citrix Analytics for Security that assesses the behavior of Citrix Virtual Apps and Desktops, and Citrix Workspace users and applies actions to protect sensitive corporate information; Citrix Analytics for Performance, which uses machine learning to quantify user experience; Citrix Secure Workspace Access that provides an end-to-end solution to implement Zero Trust principles; and Citrix Secure Internet Access, which provides a solution that protects direct internet access for branch and remote workers using unsanctioned apps. It also provides Citrix ADC that offers application delivery controller, on-premise, in-cloud, and SaaS deployment option solutions. In addition, the company provides customer services, hardware maintenance, consulting, and product training and certification services. The company serves healthcare, financial services, technology, manufacturing, consumer, and government agencies. It markets and licenses its products through resellers, distributors, systems integrators, independent software vendors, original equipment manufacturers, and service providers. The company was formerly known as Citrus Systems, Inc. and changed its name to Citrix Systems, Inc. in March 2009. Citrix Systems, Inc. was incorporated in 1989 and is headquartered in Fort Lauderdale, Florida.",
      "market_cap": 12564594688,
      "dividend_yield": 0.0146
    },
    "roce": 5.120042514831938,
    "ebit": {
      "2021-01-01SEP2021-12-31": "236620000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "23662000061633000"
    },
    "high_low": {
      "high": 144.47000122070312,
      "low": 142.52999877929688
    }
  },
  "PTC INC": {
    "details": {
      "summary": "PTC Inc. operates as software and services company in the Americas, Europe, and the Asia Pacific. The company operates in two segments, Software Products and Professional Services. It offers ThingWorx platform, which offers a set of capabilities that enable enterprises to digitally transform every aspect of their business with innovative solutions that are simple to create, easy to implement, scalable to meet future needs, and designed to enable customers to accelerate time to value; and Vuforia, which enables the visualization of digital information in a physical context and the creation of AR. The company also provides Onshape, a software-as-a-service product development platform unites computer-aided design with data management, collaboration tools, and real-time analytics; Arena, a PLM solution enables product teams to collaborate virtually anytime and anywhere; Creo, a 3D CAD technology enables the digital design, testing, and modification of product models; and Windchill, a product lifecycle management software. In addition, it offers Integrity, an application lifecycle management solution; Servigistics, service parts management solution; and consulting, implementation, training, cloud, and license and support services. The company was formerly known as Parametric Technology Corporation and changed its name to PTC Inc. in January 2013. PTC Inc. was incorporated in 1985 and is headquartered in Boston, Massachusetts.",
      "market_cap": 13133297664,
      "dividend_yield": null
    },
    "roce": 10.21243587522175,
    "ebit": {
      "2020-10-01SEP2021-09-30": "380748000"
    },
    "ebitda": {
      "2020-10-01SEP2021-09-30": "38074800021000000.0"
    },
    "high_low": {
      "high": 153.72999572753906,
      "low": 148.9499969482422
    }
  },
  "QUALYS INC": {
    "details": {
      "summary": "Qualys, Inc. provides cloud-based information technology (IT), security, and compliance solutions in the United States and internationally. The company offers Qualys Cloud Apps, which includes Vulnerability Management, Vulnerability Management, Detection and Response, Threat Protection, Continuous Monitoring, Patch Management, Multi-Vector Endpoint Detection and Response, Indication of Compromise, Certificate Assessment, Policy Compliance, Security Configuration Assessment, PCI Compliance, File Integrity Monitoring, Security Assessment Questionnaire, Out of-Band Configuration Assessment, Web Application Scanning, Web Application Firewall, Global IT Asset Inventory, CMDB Sync, Certificate Inventory, Cloud Inventory, Cloud Security Assessment, and Container Security. Its integrated suite of IT, security, and compliance solutions delivered on its Qualys Cloud Platform enables customers to identify and manage IT assets, collect and analyze IT security data, discover and prioritize vulnerabilities, recommend and implement remediation actions, and verify the implementation of such actions. The company also provides asset tagging and management, reporting and dashboards, questionnaires and collaboration, remediation and workflow, big data correlation and analytics engine, and alerts and notifications, which enable integrated workflows, management and real-time analysis, and reporting across IT, security, and compliance solutions. The company offers its solutions through its sales teams, as well as through its network of channel partners, such as security consulting organizations, managed service providers and resellers, and consulting firms. It serves enterprises, government entities, and small and medium-sized businesses in various industries, including education, financial services, government, healthcare, insurance, manufacturing, media, retail, technology, and utilities. The company was incorporated in 1999 and is headquartered in Foster City, California.",
      "market_cap": 5175640576,
      "dividend_yield": null
    },
    "roce": 17.183344797649912,
    "ebit": {
      "2021-01-01SEP2021-12-31": "87683000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "8768300035897000"
    },
    "high_low": {
      "high": 142.94000244140625,
      "low": 140.33999633789062
    }
  },
  "ALTAIR ENGINEERING INC": {
    "details": {
      "summary": "Altair Engineering Inc., together with its subsidiaries, provides software and cloud solutions in the areas of simulation, high-performance computing, data analytics, and artificial intelligence worldwide. The company operates through two segments, Software and Client Engineering Services. Its software segment includes solvers and optimization technology products, high-performance computing software applications and hardware products, modeling and visualization tools, data analytics and analysis products, and IoT platform and analytics tools, as well as support and complementary software products. This segment also provides software technologies in the areas of computational fluid dynamics and fatigue, manufacturing process simulation, and cost estimation for the applications in marine, motorcycle, aerospace, chemical, and architecture industries; and software-related services, such as consulting, implementation, and training services focused on product design and development expertise and analysis from the component level up to complete product engineering at various stage of the lifecycle. The Client Engineering Services segment offers client engineering services. Its integrated suite of software optimizes design performance across various disciplines, including structures, motion, fluids, thermal management, electromagnetics, system modeling, and embedded systems. Altair Engineering Inc. was founded in 1985 and is headquartered in Troy, Michigan.",
      "market_cap": 5057990656,
      "dividend_yield": null
    },
    "roce": 1.7900846804788069,
    "ebit": {
      "2021-01-01SEP2021-12-31": "12339000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "1233900025644000"
    },
    "high_low": {
      "high": 82.95999908447266,
      "low": 79.70999908447266
    }
  },
  "PAYCOM SOFTWARE INC": {
    "details": {
      "summary": "Paycom Software, Inc. provides cloud-based human capital management (HCM) solution delivered as software-as-a-service for small to mid-sized companies in the United States. It offers functionality and data analytics that businesses need to manage the employment life cycle from recruitment to retirement. The company's HCM solution provides a suite of applications in the areas of talent acquisition, including applicant tracking, candidate tracker, background checks, on-boarding, e-verify, and tax credit services; and time and labor management, such as time and attendance, scheduling/schedule exchange, time-off requests, labor allocation, labor management reports/push reporting, and geofencing/geotracking. Its HCM solution also offers payroll applications comprising payroll and tax management, Paycom pay, expense management, mileage tracker/fixed and variable rates, garnishment management, and GL concierge applications; and talent management applications that include employee self-service, compensation budgeting, performance management, and Paycom learning, course content, and subscriptions, as well as my analytics, which offer employment predictor reporting. In addition, the company's HCM solution provides HR management applications comprising manager on-the-go that gives supervisors and managers the ability to perform a variety of tasks, such as approving time-off requests and expense reimbursements; direct data exchange; ask here, a tool for direct line of communication to ask work-related questions; document and checklist; government and compliance; benefits administration/benefits to carrier; COBRA administration; personnel action forms; surveys; and affordable care act applications. Paycom Software, Inc. was founded in 1998 and is headquartered in Oklahoma City, Oklahoma.",
      "market_cap": 21550462976,
      "dividend_yield": null
    },
    "roce": 20.70382572556512,
    "ebit": {
      "2021-01-01SEP2021-12-31": "253567000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "25356700067222000"
    },
    "high_low": {
      "high": 558.969970703125,
      "low": 547.1900024414062
    }
  },
  "8X8 INC": {
    "details": {
      "summary": "8x8, Inc. provides voice, video, chat, contact center, and enterprise-class application programmable interface (API) Software-as-a-Service solutions for small and mid-size businesses, mid-market and larger enterprises, government agencies, and other organizations worldwide. It offers unified communications, team collaboration, video conferencing, contact center, data and analytics, communication APIs, and other services. The company provides 8x8 Work, a self-contained end-to-end united communications solution that delivers enterprise voice with public switched telephone network connectivity, video meetings, and unified messaging; 8x8 Contact Center, a multi-channel cloud-based contact center solution; and 8x8 Meet, a cloud-based video conferencing and collaboration solution that enables secure and continuous collaboration with borderless high definition video and audio communications from mobile and desktop devices. It also offers 8x8 Team Messaging, an integrated open team messaging platform, which facilitate modern modes of communication with support for direct messages, public and private team messaging rooms, short messaging service, presence, emojis, and Â\u0091@ mentions'; 8x8 CPaaS, a set of global communications Platform-as-a-Service; and X1 through X4 and X5 through X8, which provide enterprise-grade voice, unified communications, and video meetings and team collaboration, and contact centre solutions. The company markets its services to end users through search engine marketing and optimization, third-party lead generation sources, industry conferences, trade shows, Webinars, and digital advertising channels, as well as direct sales organization. 8x8, Inc. was incorporated in 1987 and is headquartered in Campbell, California.",
      "market_cap": 1339455360,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "VERITONE INC": {
    "details": {
      "summary": "Veritone, Inc., together with its subsidiaries, provides artificial intelligence (AI) computing solutions in the United States and the United Kingdom. The company develops and operates aiWARE platform, an AI operating system that uses machine learning algorithms or AI models, such as cognitive queries, predictions, correlations, and analyses in real-time using AI models in various categories comprising transcription, face recognition, and object recognition to reveal valuable insights from vast amounts of structured and unstructured data. It also provides media advertising agency services, including media planning and strategy, advertisement buying and placement, campaign messaging, clearance verification and attribution, and custom analytics directly to advertisers through outbound sales networking, and client and partner referrals, as well as indirectly through advertising agencies or marketing consultants. The company serves media and entertainment, government, legal and compliance, energy, and other vertical markets. It has a strategic relationship with Alteryx, Inc. to power the Alteryx analytic process automation platform with New, advanced AI capabilities. The company was formerly known as Veritone Delaware, Inc. and changed its name to Veritone, Inc. in July 2014. Veritone, Inc. was incorporated in 2014 and is headquartered in Denver, Colorado.",
      "market_cap": 644170752,
      "dividend_yield": null
    },
    "roce": -21.452678992969158,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-67249000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-672490009035000"
    },
    "high_low": {
      "high": 37.13999938964844,
      "low": 33.04999923706055
    }
  },
  "HUBSPOT INC": {
    "details": {
      "summary": "HubSpot, Inc. provides a cloud-based customer relationship management (CRM) platform for businesses in the Americas, Europe, and the Asia Pacific. The company's CRM platform includes marketing, sales, service, and content management systems, as well as integrated applications, such as search engine optimization, blogging, website content management, messaging, chatbots, social media, marketing automation, email, predictive lead scoring, sales productivity, ticketing and helpdesk tools, customer NPS surveys, analytics, and reporting. It also offers professional, as well as phone and/or email and chat based support services. It serves mid-market business-to-business companies. HubSpot, Inc. was incorporated in 2005 and is headquartered in Cambridge, Massachusetts.",
      "market_cap": 23234193408,
      "dividend_yield": null
    },
    "roce": -3.518665964632909,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-54799000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-5479900045159000"
    },
    "high_low": {
      "high": 866.0,
      "low": 832.5599975585938
    }
  },
  "DOMO INC": {
    "details": {
      "summary": "Domo, Inc. operates a cloud-based platform in the United States. Its platform digitally connects from the chief executive officer to the frontline employee with the people, data, and systems in an organization, giving them access to real-time data and insights, and allowing them to manage business from smartphones. The company was formerly known as Domo Technologies, Inc. and changed its name to Domo, Inc. in December 2011. Domo, Inc. was incorporated in 2010 and is headquartered in American Fork, Utah.",
      "market_cap": 1569202816,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "EVERBRIDGE INC": {
    "details": {
      "summary": "Everbridge, Inc. operates as a software company in the United States and internationally. Its Critical Event Management, a software as a service based platform with various software applications that address tasks an organization has to perform to manage a critical event, including Mass Notification that enables enterprises and governmental entities to send notifications to individuals or groups to keep them informed before, during, and after natural or man-made disasters, and other emergencies; Safety Connection that enables organizations to send notifications based on last known location of an individual; Incident Management for organizations to automate workflows and make their communications relevant; and IT Alerting that enables IT professionals to alert and communicate during an IT incident or outage. Its software applications also include Visual Command Center that enables customers to monitor and integrate threat data, and information on internal incidents; Public Warning to reach international mobile populations; Community Engagement that integrates emergency management and community outreach; Risk Center solution that aggregates data to assess incidents and provide incident information and analysis; Crisis Management that provides mobile access to crisis, recovery, and brand protection plans; Secure Collaboration solution to exchange messages, voice, images, and video chats; and Control Center application used for mission-critical control. It also provides customer support services. It serves enterprises, small businesses, non-profit organizations, educational institutions, and government agencies in technology, energy, financial services, healthcare and life sciences, manufacturing, media and entertainment, retail, higher education, and professional services industries. The company was formerly known as 3n Global, Inc. and changed its name to Everbridge, Inc. in April 2009. The company was founded in 2002 and is headquartered in Burlington, Massachusetts.",
      "market_cap": 1575647488,
      "dividend_yield": null
    },
    "roce": -6.491016740658134,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-76249000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-7624900053168000"
    },
    "high_low": {
      "high": 167.39999389648438,
      "low": 164.38999938964844
    }
  },
  "UNITY SOFTWARE INC": {
    "details": {
      "summary": "Unity Software Inc. operates a real-time 3D development platform. Its platform provides software solutions to create, run, and monetize interactive, real-time 2D and 3D content for mobile phones, tablets, PCs, consoles, and augmented and virtual reality devices. The company offers its solutions directly through its online store and field sales operations in North America, Denmark, Finland, the United Kingdom, Germany, Japan, China, Singapore, and South Korea, as well as indirectly through independent distributors and resellers worldwide. The company was founded in 2004 and is headquartered in San Francisco, California.",
      "market_cap": 28391213056,
      "dividend_yield": null
    },
    "roce": -12.611215256091887,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-531665000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-53166500064567000"
    },
    "high_low": {
      "high": 210.0,
      "low": 197.13999938964844
    }
  },
  "BILL.COM HOLDINGS INC": {
    "details": {
      "summary": "Bill.com Holdings, Inc. provides cloud-based software that simplifies, digitizes, and automates back-office financial operations for small and midsize businesses worldwide. It offers artificial intelligence enabled financial software platform that creates seamless connections among users, suppliers, and the clients. The company provides software-as-a-service, cloud-based payments and spend management products, which allow users to automate accounts payable and accounts receivable transactions, as well as enable users to connect with their suppliers and/or customers to do business, eliminate expense reports, manage cash flows, and improve office efficiency. It also offers onboarding implementation support, and ongoing support and training services. The company also serves accounting firms and financial institutions. Bill.com Holdings, Inc. was founded in 2006 and is headquartered in San Jose, California.",
      "market_cap": 23057215488,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "LIVEPERSON INC": {
    "details": {
      "summary": "LivePerson, Inc., together with its subsidiaries, provides conversational commerce solutions. The company operates in two segments, Business and Consumer. The Business segment enables brands to leverage LiveEngage's intelligence engine to connect with consumers through an integrated suite of mobile and online business messaging technologies. The Consumer segment facilitates online transactions between independent service providers and individual consumers seeking information and knowledge through mobile and online messaging. The company offers The Conversational Cloud, an enterprise-class and cloud-based platform, which enables businesses and consumers to connect through conversational interfaces, such as in-app and mobile messaging. It also provides professional services and value-added business consulting services. The company sells its products through direct and indirect sales channels to Fortune 500 companies, Internet businesses, online merchants, small businesses, automotive dealers, universities, libraries, government agencies, and not-for-profit organizations. It operates in the United States, Canada, Latin America, South America, Europe, the Middle East, Africa, and the Asia-Pacific region. The company has strategic partnerships with TTEC that focuses on customer experience; and DMI to redefine customer experience with digital engagement, messaging, and artificial intelligence driven automation. LivePerson, Inc. was founded in 1995 and is headquartered in New York, New York.",
      "market_cap": 1822222592,
      "dividend_yield": null
    },
    "roce": -24.76503510587825,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-238544000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-23854400027400000"
    },
    "high_low": {
      "high": 68.81999969482422,
      "low": 67.44000244140625
    }
  },
  "BOTTOMLINE TECHNOLOGIES INC": {
    "details": {
      "summary": "Bottomline Technologies, Inc. provides various solutions for the banking, financial services, insurance, healthcare, technology, retail, communications, education, media, manufacturing, and government industries. It operates through four segments: Cloud Solutions, Banking Solutions, Payments and Documents, and Other. The company's products and services include Paymode-X, a SaaS solution, which allows businesses to transition from legacy invoice-to-pay processes maximizing cost-savings, efficiency, and security; PTX, a payment platform that offers various ways to pay and get paid to organizations; and financial messaging solutions for risk management to financial institutions and corporations. It also provides Digital Banking IQ, an intelligent engagement platform for banking and payments; and legal spend management solutions, which integrate with claims management, and time and billing systems to automate legal invoice management processes, as well as provide insight into various areas of a company's outside legal spend. In addition, the company offers fraud and financial crime solutions to monitor, replay, and analyze user behavior and payment transactions to flag and prevent suspicious activity in real time; and healthcare solutions, including electronic signature and mobile document. Further, it provides consulting, implementation, and training services. The company serves customers in the United States, the United Kingdom, Continental Europe, the Asia-Pacific, and the Middle East. Bottomline Technologies, Inc. was founded in 1989 and is headquartered in Portsmouth, New Hampshire.",
      "market_cap": 2560885760,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "WORKDAY INC": {
    "details": {
      "summary": "Workday, Inc. provides enterprise cloud applications worldwide. Its applications help its customers to manage critical business functions and optimize their financial and human resources. The company offers a suite of financial management applications, which enable chief financial officers to maintain accounting information in the general ledger; manage financial processes; identify real-time financial, operational, and management insights; enhance financial consolidation; reduce time-to-close; promote internal control and auditability; and achieve consistency across finance operations. It also provides cloud spend management solutions; a suite of human capital management applications that allows organizations to manage the entire employee lifecycle from recruitment to retirement; Workday applications for planning; and applications for analytics and reporting, including augmented analytics to surface insights to the line of business in simple-to-understand stories, machine learning to drive efficiency and automation, and benchmarks to compare performance against other companies. In addition, the company offers Workday applications serving industries, such as healthcare, higher education, and professional services. It serves technology, financial services, business and professional services, healthcare and life sciences, manufacturing, retail, and hospitality industries; and educational institutions, government agencies, and nonprofit organizations. Workday, Inc. has a strategic partnership with Google LLC to digitally transform enterprises worldwide. The company was formerly known as North Tahoe Power Tools, Inc. and changed its name to Workday, Inc. in July 2005. Workday, Inc. was founded in 2005 and is headquartered in Pleasanton, California.",
      "market_cap": 60899999744,
      "dividend_yield": null
    },
    "roce": -2.1443105337298483,
    "ebit": {
      "2021-02-01SEP2022-01-31": "-116450000"
    },
    "ebitda": {
      "2021-02-01SEP2022-01-31": "-116450000343723000"
    },
    "high_low": {
      "high": 307.80999755859375,
      "low": 298.5400085449219
    }
  },
  "2U INC": {
    "details": {
      "summary": "2U, Inc. operates as an education technology company in the United States, Hong Kong, South Africa, and the United Kingdom. The company operates in two segments, Degree Program and Alternative Credential. The Degree Program segment provides the technology and services to nonprofit colleges and universities to enable the online delivery of degree programs. This segment targets students seeking an undergraduate or graduate degree. The Alternative Credential segment offers online short courses, and technical and skills-based boot camps through nonprofit colleges and universities. This segment targets students seeking to reskill or upskill through shorter duration and lower-priced offerings. It also provides 2UOS, a platform that provides front-end and back-end cloud-based SaaS technology and technology-enabled services. The company was formerly known as 2Tor Inc. and changed its name to 2U, Inc. in October 2012. 2U, Inc. was founded in 2008 and is headquartered in Lanham, Maryland.",
      "market_cap": 927830528,
      "dividend_yield": null
    },
    "roce": 50.706980772666846,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-167438000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-167438000108448000"
    },
    "high_low": {
      "high": 46.52000045776367,
      "low": 45.43000030517578
    }
  },
  "PROGRESS SOFTWARE CORP": {
    "details": {
      "summary": "Progress Software Corporation develops, deploys, and manages business applications. The company offers OpenEdge, a development software, which builds multi-language applications for secure deployment across various platforms and devices, as well as cloud; developer tools that consists of components for user interface development for Web, mobile, desktop, chat, and AR/VR apps, as well as automated application testing and reporting tools; Sitefinity, a web content management and customer analytics platform; Corticon, a business rules management system that provides applications with decision automation and change process, and decision-related insight capabilities. It also offers DataDirect Connect, which provides data connectivity using industry-standard interfaces to connect applications running on various platforms; MOVEit that offers secure collaboration and automated file transfers of critical business information; Chef, an infrastructure automation platform to build, deploy, manage, and secure applications in multi-cloud and hybrid environments, and on-premises; and WhatsUp Gold, a network monitoring solution. In addition, the company provides Kemp LoadMaster, a load balancing solutions; and Kemp Flowmon network performance monitoring and diagnostic solutions that collect and analyze network telemetry from various sources. Further, it provides project management, implementation, custom development, programming, and other services, as well as web-enable applications; and training services. The company sells its products to end users, independent software vendors, original equipment manufacturers, and system integrators. It has operations in the United States, Canada, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. The company was founded in 1981 and is headquartered in Bedford, Massachusetts.",
      "market_cap": 1986942080,
      "dividend_yield": 0.016300000000000002
    },
    "roce": 11.157131215597035,
    "ebit": {
      "2020-12-01SEP2021-11-30": "116102000"
    },
    "ebitda": {
      "2020-12-01SEP2021-11-30": "1161020005477000"
    },
    "high_low": {
      "high": 53.9900016784668,
      "low": 52.27000045776367
    }
  },
  "A10 NETWORKS INC": {
    "details": {
      "summary": "A10 Networks, Inc. provides networking solutions in the United States, Japan, other Asia Pacific, and EMEA countries. The company offers Thunder Application Delivery Controller (ADC) that provides advanced server load balancing; Lightning ADC, a cloud-native software-as-a-service platform to boost the delivery and security of applications and micro services; and Thunder Carrier Grade Networking product, which offers standards-compliant address and protocol translation services for service provider networks. It also provides Thunder Threat Protection System (TPS) for the protection of networks and server resources against massive distributed denial of service attacks; Thunder Secure Sockets Layer (SSL) Insight solution that decrypts SSL-encrypted traffic and forwards it to a third-party security device for deep packet inspection; and Thunder Convergent Firewall, which addresses various critical security capabilities in one package by consolidating various security and networking functions in a single appliance. In addition, the company offers intelligent management and automation tools comprising harmony controller that provides intelligent management, automation, and analytics for secure application delivery in multi-cloud environment; and aGalaxy TPS, a multi-device network management solution. The company delivers its solutions on optimized hardware appliances, bare metal software, containerized software, virtual appliances, and cloud-native software. It serves cloud providers, service providers, government organizations, and enterprises in the telecommunications, technology, industrial, retail, government, financial, gaming, and education industries. The company markets its products through sales organizations, as well as distribution channel partners, including distributors, value added resellers, and system integrators. A10 Networks, Inc. was incorporated in 2004 and is headquartered in San Jose, California.",
      "market_cap": 1084923136,
      "dividend_yield": 0.0126
    },
    "roce": 12.053429602888087,
    "ebit": {
      "2021-01-01SEP2021-12-31": "33388000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "333880008907000"
    },
    "high_low": {
      "high": 19.049999237060547,
      "low": 16.489999771118164
    }
  },
  "FAIR ISAAC CORP": {
    "details": {
      "summary": "Fair Isaac Corporation develops analytic, software, and data management products and services that enable businesses to automate, enhance, and connect decisions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It operates through two segments, Scores and Software. The Software segment offers pre-configured decision management solution designed for various business problems or processes, such as marketing, account origination, customer management, customer engagement, fraud detection, financial crimes compliance, collection, and marketing, as well as associated professional services. This segment also provides FICO Platform, a modular software offering designed to support advanced analytic and decision use cases, as well as stand-alone analytic and decisioning software that can be configured by customers to address a wide range of business use cases. The Scores segment provides business-to-business scoring solutions and services for consumers that give clients access to analytics to be integrated into their transaction streams and decision-making processes, as well as business-to-consumer scoring solutions comprising myFICO.com subscription offerings. Fair Isaac Corporation markets its products and services primarily through its direct sales organization and indirect channels, as well as online. The company was formerly known as Fair Isaac & Company, Inc. and changed its name to Fair Isaac Corporation in July 1992. Fair Isaac Corporation was founded in 1956 and is headquartered in Bozeman, Montana.",
      "market_cap": 13450757120,
      "dividend_yield": null
    },
    "roce": 52.4524350837672,
    "ebit": {
      "2020-10-01SEP2021-09-30": "529019000"
    },
    "ebitda": {
      "2020-10-01SEP2021-09-30": "52901900025592000"
    },
    "high_low": {
      "high": 553.969970703125,
      "low": 545.7899780273438
    }
  },
  "DATADOG INC": {
    "details": {
      "summary": "Datadog, Inc. provides monitoring and analytics platform for developers, information technology operations teams, and business users in the cloud in North America and internationally. The company's SaaS platform integrates and automates infrastructure monitoring, application performance monitoring, log management, and security monitoring to provide real-time observability of customers technology stack. Its platform also provides user experience and network performance monitoring, incident management, and various shared features, such as sophisticated dashboards, advanced analytics, collaboration tools, and alerting capabilities. The company was incorporated in 2010 and is headquartered in New York, New York.",
      "market_cap": 45479448576,
      "dividend_yield": null
    },
    "roce": -1.0342865226354112,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-19156000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-1915600022938000"
    },
    "high_low": {
      "high": 199.6750030517578,
      "low": 192.0
    }
  },
  "ANAPLAN INC": {
    "details": {
      "summary": "Anaplan, Inc. provides a cloud-based connected planning platform to connect organizations and people. Its platform in-memory data storage and calculation capabilities deliver calculations of data in real time and provide a single source of information for planning, ensuring the consistency, quality, and integrity of the data that is used in various areas of an organization, such as finance, sales, supply chain, marketing, human resources, and operations. The company delivers its application over the Internet as a subscription service using a software-as-a-service model, as well as offers professional services related to implementing and supporting its application. It has operations in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company was founded in 2008 and is headquartered in San Francisco, California.",
      "market_cap": 7470220800,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "SUMO LOGIC INC": {
    "details": {
      "summary": "Sumo Logic, Inc. provides cloud-native software-as-a-service platform that enables organizations to address the challenges and opportunities presented by digital transformation, modern applications, and cloud computing worldwide. Its platform enables organizations to automate the collection, ingestion, and analysis of application, infrastructure, security, and IoT data to derive actionable insights. The company offers a suite of solutions to address areas, such as operational intelligence, security intelligence, business intelligence, and global intelligence. Sumo Logic, Inc. was incorporated in 2010 and is headquartered in Redwood City, California.",
      "market_cap": 1236524160,
      "dividend_yield": null
    },
    "roce": -28.007889090837708,
    "ebit": {
      "2021-02-01SEP2022-01-31": "-121275000"
    },
    "ebitda": {
      "2021-02-01SEP2022-01-31": "-12127500014181000"
    },
    "high_low": {
      "high": 23.479999542236328,
      "low": 22.030000686645508
    }
  },
  "OKTA INC": {
    "details": {
      "summary": "Okta, Inc. provides identity management platform for enterprises, small and medium-sized businesses, universities, non-profits, and government agencies in the United States and internationally. The company offers Okta Identity Cloud, a platform that offers a suite of products to manage and secure identities, such as Universal Directory, a cloud-based system of record to store and secure user, application, and device profiles for an organization; and Single Sign-On that enables users to access their applications in the cloud or on-premise from various devices with a single entry of their user credentials. It also provides Adaptive Multi-Factor Authentication, a product that provides an additional layer of security for cloud, mobile, and Web applications, as well as for data; Lifecycle Management, which enables IT organizations or developers to manage a user's identity throughout its lifecycle; API Access Management that enables organizations to secure APIs; Advanced Server Access to secure cloud infrastructure; and Access Gateway that enables organizations to extend the Okta Identity Cloud from the cloud to their existing on-premise applications. In addition, the company offers customer support and training, and professional services. Okta, Inc. sells its products directly to customers through sales force, as well as through channel partners. The company was formerly known as Saasure, Inc. Okta, Inc. was incorporated in 2009 and is headquartered in San Francisco, California.",
      "market_cap": 27142428672,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "SPS COMMERCE INC": {
    "details": {
      "summary": "SPS Commerce, Inc. provides cloud-based supply chain management solutions worldwide. It offers solutions through the SPS Commerce, a cloud-based platform that enhances the way retailers, suppliers, grocers, distributors, and logistics firms manage and fulfill orders, administer sell-through performance, and source new items. The company offers Fulfillment solution that provides fulfillment automation and replaces or augments an organization's existing staff and trading partner electronic communication infrastructure by enabling easy compliance with retailers' rulebooks, automatic, and digital exchange of information among numerous trading partners through various protocols, and greater visibility into the journey of an order; and Analytics solution, which consists of data analytics applications that enables customers to enhance their visibility across their supply chains through greater analytics capabilities. It also offers various peripheral solutions, such as assortment solution, which enables accurate order management and rapid fulfillment; and community solution that accelerates vendor onboarding and ensures trading partner adoption of new supply chain requirements. The company sells its solutions through retailer, supplier, and other sales representatives to small- to mid-sized suppliers, as well as retailers, distributors, third-party logistics providers, and other trading partners. The company was formerly known as St. Paul Software, Inc. and changed its name to SPS Commerce, Inc. in May 2001. SPS Commerce, Inc. was incorporated in 1987 and is headquartered in Minneapolis, Minnesota.",
      "market_cap": 4823158784,
      "dividend_yield": null
    },
    "roce": 10.738361008550141,
    "ebit": {
      "2021-01-01SEP2021-12-31": "55085000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "5508500014788000"
    },
    "high_low": {
      "high": 174.4199981689453,
      "low": 168.8800048828125
    }
  },
  "DYNATRACE INC": {
    "details": {
      "summary": "Dynatrace, Inc. provides a software intelligence platform for dynamic multi-cloud environments. It operates Dynatrace, a software intelligence platform for running and optimizing the applications and services. The company's products include AppMon that works in various application environments, such as Java, .NET, PHP, Node.js, GoLang, SQL, NoSQL, CICS, IMS, AWS Lambda, Google Cloud Functions, and Microsoft Azure Functions; and Classic Real User Monitoring. Its platform allows its customers to modernize and automate IT operations, develop and release software, and enhance user experiences. The company also offers implementation, consulting, and training services. Dynatrace, Inc. markets its products through a combination of direct sales team and a network of partners, including resellers, system integrators, and managed service providers. It serves customers in various industries comprising banking, insurance, retail, manufacturing, travel, and software. The company operates in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. Dynatrace, Inc. was founded in 2005 and is headquartered in Waltham, Massachusetts.",
      "market_cap": 12950775808,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "ZOOMINFO TECHNOLOGIES": {
    "details": {
      "summary": "ZoomInfo Technologies Inc., through its subsidiaries, provides go-to-market intelligence and engagement platform for sales and marketing teams in the United States and internationally. The company's cloud-based platform provides information on organizations and professionals to help users identify target customers and decision makers, obtain continually updated predictive lead and company scoring, monitor buying signals and other attributes of target companies, craft messages, engage through automated sales tools, and track progress through the deal cycle. It serves enterprises, mid-market companies, and down to small businesses that operate in various industry verticals, including software, business services, manufacturing, telecommunications, financial services, media and internet, transportation, education, hospitality, and real estate. ZoomInfo Technologies Inc. was founded in 2007 and is headquartered in Vancouver, Washington.",
      "market_cap": 23713191936,
      "dividend_yield": null
    },
    "roce": 1.7855735741414906,
    "ebit": {
      "2021-01-01SEP2021-12-31": "113300000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "11330000069300000"
    },
    "high_low": {
      "high": 79.16999816894531,
      "low": 76.61399841308594
    }
  },
  "NUTANIX INC": {
    "details": {
      "summary": "Nutanix, Inc. provides an enterprise cloud platform in North America, Europe, the Asia Pacific, the Middle East, Latin America, and Africa. The company offers Acropolis converges virtualization, enterprise storage services, and networking visualization and security services; Acropolis Hypervisor, an enterprise-grade virtualization solution; Nutanix Karbon for automated deployment and management of Kubernetes clusters to simplify the provisioning, operations, and lifecycle management of cloud-native environments; and Nutanix Clusters solution. It also offers Prism Pro; Nutanix Beam, a cloud governance; and Nutanix Calm, an application marketplace, which provides automation services that streamline application lifecycle management and deliver powerful hybrid cloud orchestration. In addition, the company provides Nutanix Files, an enterprise-grade NFS and SMB files services; Nutanix Objects, a S3-compatible object services; Nutanix Era, a database automation and database-as-a-service solution; and Nutanix Frame, a desktop-as-a-service product to deliver virtual apps or desktops to users from multiple public cloud environments and/or an enterprises private cloud datacenter. Further, it offers products support, and consulting and implementation services. It serves customers in a range of industries, including automotive, consumer goods, education, energy, financial services, healthcare, manufacturing, media, public sector, retail, technology, and telecommunications, as well as service providers. The company was incorporated in 2009 and is headquartered in San Jose, California.",
      "market_cap": 5695908864,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "INUVO INC": {
    "details": {
      "summary": "Inuvo, Inc., a technology company, develops and sells information technology solutions in the United States. The company's platforms identify and message online audiences for various products or services across devices and channels and formats, including video, mobile, connected TV, display, and social and native. Its platform also allows advertisers and publishers to buy and sell advertising space in real time. The company's products and services include ValidClick that provides marketing service online, as well as indirectly to various advertisers, where a collection of data, analytics, and software gets used to align merchant advertising messages with anonymous consumers across various websites online; and IntentKey, an artificial intelligence based consumer intent recognition system designed to reach targeted mobile and desktop in-market audiences. It also operates a collection of websites including alot.com and earnspendlive.com, which creates content in health, finance, travel, careers, auto, education, and living categories. The company's marketing channels consist of websites, social media, blogs, public relations, trade shows, and conferences. Inuvo, Inc. was incorporated in 1987 and is headquartered in Little Rock, Arkansas.",
      "market_cap": 58779764,
      "dividend_yield": null
    },
    "roce": -23.311082635470992,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-7770641"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-77706413143168"
    },
    "high_low": {
      "high": 1.2699999809265137,
      "low": 1.1299999952316284
    }
  },
  "SPLUNK INC": {
    "details": {
      "summary": "Splunk Inc. provides software and cloud solutions that deliver and operationalize insights from the data generated by digital systems in the United States and internationally. The company offers Splunk Platform, a real-time data platform comprising collection, streaming, indexing, search, reporting, analysis, machine learning, alerting, monitoring, and data management capabilities. It also provides Splunk Solutions, such as Splunk Security solutions that enable cybersecurity teams streamline the security operations workflow, accelerate threat detection and response, enhance threat visibility, and scale resources to increase analyst productivity through machine learning and runbook-driven automation; Splunk IT Solutions that provide IT Operations teams visibility and control across cloud and on-premises environments; and Splunk Observability Solutions for building and maintaining infrastructure and applications. In addition, the company offers Ecosystem Solutions, which includes pre-built data inputs, workflows, searches, reports, alerts, custom dashboards, flexible UI components, custom data visualizations, and integration actions and methods, as well as Splunk On-Call, Splunk Infrastructure Monitoring, and Splunk Phantom solutions, which provides APIs, SDKs, and other interfaces that enable its ecosystem, including third-party developers, partners, and customers to build content that configures and extends Splunk solutions to accommodate specific use cases. Further, the company provides adoption and implementation services, education services, and maintenance and customer support services. It sells its offerings directly through field and inside sales, and indirectly through various routes to market with various partners. Splunk Inc. has a strategic partnership with Tenable Holdings, Inc. to secure active directory and converged operational technology environments. The company was incorporated in 2003 and is headquartered in San Francisco, California.",
      "market_cap": 20326324224,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "SERVICENOW INC": {
    "details": {
      "summary": "ServiceNow, Inc. provides enterprise cloud computing solutions that defines, structures, consolidates, manages, and automates services for enterprises worldwide. It operates the Now platform for workflow automation, artificial intelligence, machine learning, performance analytics, electronic service catalogs and portals, configuration management systems, data benchmarking, encryption, and collaboration and development tools. The company also provides information technology (IT) service management applications; IT service management product suite for enterprise's employees, customers, and partners; IT business management product suite; IT operations management product that connects a customer's physical and cloud-based IT infrastructure; IT Asset Management to automate IT asset lifecycles; and enterprise development operations product for developers' toolchain. In addition, it offers security incident management, threat enrichment intelligence, vulnerability response management, and security incident intelligence sharing security operation products; governance, risk, and compliance product to create policies and controls; human resources, legal, and workplace service delivery products; safe workplace applications; customer service management product; and field service management applications. Further, it provides App Engine product; IntegrationHub enables application to extend workflows; and professional, training, and customer support services. It serves government, financial services, healthcare, telecommunications, manufacturing, IT services, technology, oil and gas, education, and consumer products through direct sales team and resale partners. It has a strategic partnership with Celonis to help customers identify and prioritize processes that are suitable for automation. The company was formerly known as Service-now.com and changed its name to ServiceNow, Inc. in May 2012. The company was incorporated in 2004 and is headquartered in Santa Clara, California.",
      "market_cap": 115396124672,
      "dividend_yield": null
    },
    "roce": 4.393913489485382,
    "ebit": {
      "2021-01-01SEP2021-12-31": "257000000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "257000000472000000"
    },
    "high_low": {
      "high": 707.5999755859375,
      "low": 689.1500244140625
    }
  },
  "COUPA SOFTWARE INC": {
    "details": {
      "summary": "Coupa Software Incorporated provides cloud-based business spend management platform. Its platform connects organizations with suppliers globally; and provides visibility into and control over how companies spend money, optimize supply chains, and manage liquidity, as well as enables businesses to achieve savings that drive profitability. The company's platform consists of procurement, invoicing, expense management, and payment modules that form the transactional engine for managing a company's business spend; and offers specialized modules, including strategic sourcing, contract management, contingent workforce, supplier risk management, supply chain design and planning, treasury management, and spend analysis. Its customers include businesses in various industries, including healthcare and pharmaceuticals, retail, financial services, manufacturing, and technology. The company markets its platform primarily through a direct sales force. Coupa Software Incorporated has a strategic partnership with Japan Cloud Computing L.P to establish a joint venture, Coupa K.K. The company was incorporated in 2006 and is headquartered in San Mateo, California.",
      "market_cap": 6770533888,
      "dividend_yield": null
    },
    "roce": -9.294093770264338,
    "ebit": {
      "2021-02-01SEP2022-01-31": "-244084000"
    },
    "ebitda": {
      "2021-02-01SEP2022-01-31": "-244084000146392000"
    },
    "high_low": {
      "high": 283.3800048828125,
      "low": 276.4540100097656
    }
  },
  "SALESFORCE.COM INC": {
    "details": {
      "summary": "salesforce.com, inc. develops enterprise cloud computing solutions with a focus on customer relationship management worldwide. The company offers Sales Cloud to store data, monitor leads and progress, forecast opportunities, and gain insights through analytics and relationship intelligence, as well as deliver quotes, contracts, and invoices. It also provides Service Cloud, which enables companies to deliver personalized customer service and support, as well as a field service solution that enables companies to connect agents, dispatchers, and mobile employees through a centralized platform, which helps to schedule and dispatch work, and track and manage jobs in real-time. In addition, the company offers Marketing Cloud to plan, personalize, and optimize one-to-one customer marketing interactions; and Commerce Cloud, which enables companies to enhance engagement, conversion, revenue, and loyalty from their customers. Further, it provides Customer 360 Platform that offers no-code to pro-code Platform-as-a-Service tools for building, securing, integrating, and managing the business apps; MuleSoft Anypoint Platform enables customers to connect any system, application, data, or device; Quip collaboration platform, which combines documents, spreadsheets, apps, and chat with live CRM data; and Tableau and Einstein Analytics, provides analytical technology to customers. Additionally, the company offers various solutions for financial services, healthcare and life sciences, manufacturing, consumer goods, government, and philanthropy. The company also provides professional services and education services, including instructor-led and online courses; and support and adoption programs. It provides its services through direct sales; and consulting firms, systems integrators, and other partners. salesforce.com, inc. has a strategic partnership with Siemens and Amazon Web Services, Inc. The company was founded in 1999 and is headquartered in San Francisco, California.",
      "market_cap": 215518003200,
      "dividend_yield": null
    },
    "roce": 0.7463804633551708,
    "ebit": {
      "2021-02-01SEP2022-01-31": "548000000"
    },
    "ebitda": {
      "2021-02-01SEP2022-01-31": "5480000003298000000"
    },
    "high_low": {
      "high": 311.75,
      "low": 307.25
    }
  },
  "APPFOLIO INC": {
    "details": {
      "summary": "AppFolio, Inc., together with its subsidiaries, provides industry-specific cloud-based business software solutions, services, and data analytics for the real estate industry. The company offers AppFolio Property Manager, a property management solution designed to address the operational and business requirements of property management companies and their business ecosystems; and AppFolio Investment Management, a cloud-based software solution for real estate investment managers of various sizes that provide tools and services designed to streamline their real estate investment management businesses. It also provides Value+ services that are designed to enhance, automate, and streamline processes and workflows for property management businesses, such as artificial intelligence leasing assistant, tenant screening, electronic payment, utility management, maintenance contact center, tenant debt collection, and mailing services. AppFolio, Inc. was incorporated in 2006 and is headquartered in Santa Barbara, California.",
      "market_cap": 3882458112,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "AVALARA INC": {
    "details": {
      "summary": "Avalara, Inc., together with its subsidiaries, provides cloud-based solutions for transaction tax compliance worldwide. The company offers a suite of compliance solutions that enable businesses to address the complexity of transaction tax compliance; process transactions in real time; produce detailed records of transaction tax determinations; and reduce errors, audit exposure, and total transaction tax compliance costs. The company's solutions include AvaTax, a solution for determining sales tax in the United States; Avalara Returns for tax return preparation, filing, and remittance; and Avalara Compliance Document Management solution, which creates, validates, stores, and manages sales tax exemption and reseller certificates. It also provides professional services, including nexus studies and analysis, voluntary compliance initiatives, tax registrations, and specialized tax research; MatrixMaster, a product taxability database for retail operations; Avalara CloudConnect, a hardware device for processing and storing transactions on-site for regularly scheduled uploads to AvaTax; Avalara Licensing, an online platform for business licenses and sales tax registrations; VAT Expert, a Web-based solution that checks the validity of customer and supplier value-added tax (VAT) numbers and provides VAT determinations in the form of invoices; and Brazilian tax compliance solutions that address the Brazilian transaction tax regimes through electronic compliance report validation, electronic invoice authentication and preparation, tax determination, and returns preparation; and Avalara Item Classification, a solution that addresses the process of assigning proper country-specific Harmonized System codes to products. The company was formerly known as Advantage Solutions, Inc. and changed its name to Avalara, Inc. in December 2005. Avalara, Inc. was incorporated in 1999 and is headquartered in Seattle, Washington.",
      "market_cap": 8072749056,
      "dividend_yield": null
    },
    "roce": -5.00047398747359,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-106553000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-10655300036526000"
    },
    "high_low": {
      "high": 191.6699981689453,
      "low": 187.64999389648438
    }
  },
  "ANSYS INC": {
    "details": {
      "summary": "ANSYS, Inc. develops and markets engineering simulation software and services worldwide. The company offers ANSYS Workbench, a framework upon which its engineering simulation technologies are built; multiphysics software to simulate the interactions between structures, heat transfer, fluids, and electronics in a unified engineering simulation environment; high-performance computing product suite; and structural analysis product suite that provides simulation tools for product design and optimization. It also provides fluids product suite that enables modeling of fluid flow and other related physical phenomena; and electronics product suite that offers field simulation software for designing electronic and electromechanical products. In addition, the company offers power analysis and optimization software suite that manages the power budget, power delivery integrity, and power-induced noise in an electronic design; SCADE product suite, a solution for embedded software simulation, code production, and automated certification; system simulation capability for the design of automated products; and optical sensor and closed-loop, and real-time simulation, as well as safety-certified embedded software solutions. Further, it provides Discovery product family for use in the simulation of product design; Ansys Granta products to give access to material intelligence; and academic product suite with a portfolio of academic products based on associate, research, and teaching, as well as develops photonic design and simulation tools. The company serves engineers, designers, researchers, and students in the aerospace and defense, automotive, electronics, semiconductors, energy, materials and chemical processing, turbomachinery, consumer products, healthcare, and sports industries. It has a collaboration with Velodyne to develop software models of next-generation automotive lidar sensors. ANSYS, Inc. was founded in 1970 and is headquartered in Canonsburg, Pennsylvania.",
      "market_cap": 27798806528,
      "dividend_yield": null
    },
    "roce": 9.255093293654214,
    "ebit": {
      "2021-01-01SEP2021-12-31": "513271000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "513271000106867000"
    },
    "high_low": {
      "high": 413.8900146484375,
      "low": 407.760009765625
    }
  },
  "MITEK SYSTEMS INC": {
    "details": {
      "summary": "Mitek Systems, Inc. develops, markets, and sells mobile image capture and digital identity verification solutions in the United States, Europe, Latin America, and internationally. The company's solutions are embedded in native mobile apps and web browsers to facilitate digital consumer experiences. It offers Mobile Deposit that enables individuals and businesses to remotely deposit checks using their camera-equipped smartphone or tablet; and Mobile Verify, an identity verification solution that is integrated into mobile apps, mobile websites, and desktop applications. The company also provides Mobile Fill, which includes automatic image capture, minimizes the numbers of clicks, and expedites form fill completion; and MiSnap, a mobile-capture software development kit that enables an intuitive user experience and instant capture of quality images of identity documents and checks. In addition, it offers CheckReader that enables financial institutions to automatically extract data from checks; Check Fraud Defender, an AI-powered and cloud-hosted model for fighting check fraud; and Check Intelligence that enables financial institutions to automatically extract data from a check image received across any deposit channel, including branch, ATM, remote deposit capture, and mobile. Further, the company provides ID_CLOUD, an automated identity verification solution that is integrated into a customers' application to read and validate identity documents; IDLive Face, a passive facial liveness detection product; IDVoice, a robust AI-driven voice biometric engine; IDLive Voice that helps stop spoofing attacks on voice biometric systems; and IDLive Doc that works to fight fraud related to digitally displayed document images. Mitek Systems, Inc. was incorporated in 1986 and is based in San Diego, California.",
      "market_cap": 661306944,
      "dividend_yield": null
    },
    "roce": 3.489502843746386,
    "ebit": {
      "2020-10-01SEP2021-09-30": "13277000"
    },
    "ebitda": {
      "2020-10-01SEP2021-09-30": "132770001400000"
    },
    "high_low": {
      "high": 23.290000915527344,
      "low": 22.729999542236328
    }
  },
  "EVOLVING SYSTEMS INC": {
    "details": {
      "summary": "Evolving Systems, Inc. provides real-time digital engagement solutions and services to the wireless carrier and consumer financial service markets in the United Kingdom and internationally. The company offers acquisition and activation solutions, including Smart Dealer, a tool set that enables SIM retailers to sell SIM cards; and Dynamic SIM Allocation, a SIM/eSIM activation solution. Its acquisition and activation solutions also comprise Tertio Service Activation solution used to activate a new subscriber or to add a new service to an existing subscriber; and Number Inventory and Management solution, an automated solution that enables operators to manage their telephone numbers and other communication identifiers. In addition, the company offers customer analytics and value management solutions, such as the Profiling Engine, a rules-driven flexible aggregator, which supports static and ongoing dynamic profiling of subscribers; Campaign Engine that is used to configure and deliver marketing campaigns, and offers to subscribers; Campaign Workflow and Journey Manager, which offers predefined templates for specific types of real-time digital marketing tactics; and Real-time Prediction and Machine Learning Module that enables churn, usage, and revenue predictions. Further, it provides Social Media Integration solution, which enables carriers to expand their engagement with subscribers; and App Promotion solution. Additionally, the company offers customer retention and loyalty solutions that reduces churn, extend the customer lifecycle, and generates revenue from existing subscribers. It also provides marketing advisory, IT, and managed services; and customer value management solutions. The company was founded in 1985 and is headquartered in Englewood, Colorado.",
      "market_cap": 23043536,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "INTUIT INC": {
    "details": {
      "summary": "Intuit Inc. provides financial management and compliance products and services for consumers, small businesses, self-employed, and accounting professionals in the United States, Canada, and internationally. The company operates in four segments: Small Business & Self-Employed, Consumer, Credit Karma, and ProConnect. The Small Business & Self-Employed segment provides QuickBooks online services and desktop software solutions comprising QuickBooks Online Advanced, a cloud-based solution; QuickBooks Enterprise, a hosted solution; QuickBooks Self-Employed solution; QuickBooks Commerce, a solution for product-based businesses; QuickBooks Online Accountant and QuickBooks Accountant Desktop Plus solutions; and payroll solutions, such as online payroll processing, direct deposit of employee paychecks, payroll reports, electronic payment of federal and state payroll taxes, and electronic filing of federal and state payroll tax forms. This segment also offers payment-processing solutions, including credit and debit cards, Apple Pay, and ACH payment services; QuickBooks Cash business bank account; and financial supplies and financing for small businesses. The Consumer segment provides TurboTax income tax preparation products and services; and personal finance. The Credit Karma segment offers consumers with a personal finance platform that provides personalized recommendations of home, auto, and personal loans, as well as credit cards and insurance products. The ProConnect segment provides Lacerte, ProSeries, and ProFile desktop tax-preparation software products; and ProConnect Tax Online tax products, electronic tax filing service, and bank products and related services. It sells products and services through various sales and distribution channels, including multi-channel shop-and-buy experiences, websites and call centers, mobile application stores, and retail and other channels. The company was founded in 1983 and is headquartered in Mountain View, California.",
      "market_cap": 135883350016,
      "dividend_yield": 0.0044
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "BRIDGELINE DIGITAL INC": {
    "details": {
      "summary": "Bridgeline Digital, Inc. operates as a digital engagement company in the United States. The company's Bridgeline's Unbound platform enables companies and developers to create websites, web applications, and online stores. It offers Bridgeline Unbound Experience Manager, a marketing automation engine and content management system; Bridgeline Unbound Content Manager that enables non-technical users to create, edit, and publish content via a browser-based interface; and Bridgeline Unbound Commerce, an online B2B and B2C commerce solution that allows users to manage domestic and international commerce initiatives. The company also provides Bridgeline Unbound Marketing, an online marketing management solution that helps marketers drive to their sites through personalized and targeted marketing automation flows; and Bridgeline Unbound Insights to manage, measure, and optimize web properties by recording detailed events and mining data for statistical analysis. In addition, it offers Bridgeline Unbound Social, a social media management solution that empowers customers to set up customized watch lists; and Bridgeline Unbound Franchises, a web content management and e-commerce platform to multi-unit organizations and franchises. Further, the company provides digital strategy, web design and development, usability engineering, information architecture, and search engine optimization services; application monitoring, emergency response, version control, load balancing, managed firewall security, and virus protection services; and shared, dedicated, and Software as a Service hosting services. Further, it offers OrchestraCMS by Bridgeline and Celebros Search by Bridgeline digital solutions. It serves vertical markets, such as financial services, retail brand names, health services and life sciences, technology, credit unions and regional banks, and associations and foundations through its direct sales force. The company was formerly known as Bridgeline Software, Inc. Bridgeline Digital, Inc. was founded in 2000 and is based in Burlington, Massachusetts.",
      "market_cap": 18642394,
      "dividend_yield": null
    },
    "roce": -4.442024632021628,
    "ebit": {
      "2020-10-01SEP2021-09-30": "-1183000"
    },
    "ebitda": {
      "2020-10-01SEP2021-09-30": "-11830002000"
    },
    "high_low": {
      "high": 14.380000114440918,
      "low": 11.520000457763672
    }
  },
  "MANHATTAN ASSOCIATES INC": {
    "details": {
      "summary": "Manhattan Associates, Inc. develops, sells, deploys, services, and maintains software solutions to manage supply chains, inventory, and omni-channel operations for retailers, wholesalers, manufacturers, logistics providers, and other organizations. The company offers Manhattan SCALE, a portfolio of logistics execution solutions that provide trading partner management, yard management, optimization, warehouse management, and transportation execution services; and Manhattan Active, a set of enterprise and store omni-channel solutions. It also provides inventory optimization and planning solutions; maintenance services comprising customer support services and software enhancements; professional services, such as solutions planning and implementation, and related consulting services; and training and change management services. In addition, the company resells computer hardware, radio frequency terminal networks, radio frequency identification chip readers, bar code printers and scanners, and other peripherals. It offers products through direct sales personnel, as well as through partnership agreements with various organizations. The company operates in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Manhattan Associates, Inc. was founded in 1990 and is headquartered in Atlanta, Georgia.",
      "market_cap": 8891725824,
      "dividend_yield": null
    },
    "roce": -3.6244099070940483,
    "ebit": {
      "2021-01-01SEP2021-12-31": "8407000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "8407000156000"
    },
    "high_low": {
      "high": 188.52000427246094,
      "low": 184.1300048828125
    }
  },
  "VEEVA SYSTEMS INC": {
    "details": {
      "summary": "Veeva Systems Inc. provides cloud-based software for the life sciences industry in North America, Europe, the Asia Pacific, the Middle East, Africa, and Latin America. The company offers Veeva Commercial Cloud, a suite of software, data, and analytics solutions, which include Veeva customer relationship management (CRM) and Veeva Medical CRM, Veeva CLM, Veeva CRM Approved Email, Veeva CRM Engage, Veeva Align, Veeva CRM Events Management, Veeva Nitro, Veeva Andi, Veeva OpenData, Veeva Link, Veeva Network Customer Master, Veeva Crossix, Veeva Data Cloud, and MyVeeva for Doctors; and Veeva Vault, a cloud-based enterprise content and data management applications for managing commercial functions, including sales and marketing, and medical content and communications, as well as research and development functions, such as clinical, regulatory, quality, and safety. It also provides professional and support services in the areas of implementation and deployment planning and project management; requirements analysis, solution design, and configuration; systems environment management and deployment services; services focused on advancing or transforming business and operating processes related to Veeva solutions; technical consulting services related to data migration and systems integrations; training on its solutions; and ongoing managed services that include outsourced systems administration. The company was formerly known as Verticals onDemand, Inc. and changed its name to Veeva Systems Inc. in April 2009. Veeva Systems Inc. was incorporated in 2007 and is headquartered in Pleasanton, California.",
      "market_cap": 30317647872,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "SONIC FOUNDRY INC": {
    "details": {
      "summary": "Sonic Foundry, Inc. provides video enterprise solutions and services for the digital-first, distance learning, and corporate communication markets in the United States, Europe, the Middle East, Asia, and internationally. The company offers Mediasite Video platform that automates to capture, management, delivery, and search of live and on-demand streaming video; and Mediasite Cloud, a Software as a Service solution to host and manage customers' content. It also provides Mediasite Video Capture solutions, including Mediasite Recorder and Recorder Pro that are built-in room appliances used in schedule-based capture and advanced audio/video integration; Mediasite Mobile Recorders, a portable recording devices used to capture and stream broadcast-quality video; Mediasite Mosaic that allows instructors, employees, and students to create videos, screencasts, and slideshows from their computers or mobile devices; and Mediasite Catch, a video capture software solution for classrooms. In addition, the company offers Mediasite Video Management and Delivery solutions to manage, search, analyze, publish, and stream video content. It markets its products to educational institutions, corporations, and government entities through reseller networks, direct sales, and partnerships with system integrators. The company was founded in 1991 and is headquartered in Madison, Wisconsin.",
      "market_cap": 28013708,
      "dividend_yield": null
    },
    "roce": 8.070807080708072,
    "ebit": {
      "2020-10-01SEP2021-09-30": "807000"
    },
    "ebitda": {
      "2020-10-01SEP2021-09-30": "8070001263000"
    },
    "high_low": {
      "high": 5.25,
      "low": 4.860000133514404
    }
  },
  "ZUORA INC": {
    "details": {
      "summary": "Zuora, Inc., together with its subsidiaries, provides cloud-based software on a subscription basis that enables companies in various industries to launch, manage, and transform into a subscription business. The company offers Zuora Central platform that acts as an intelligent subscription management hub that allows customers to order-to-revenue operations. Its products include Zuora Billing for subscription billing; Zuora Revenue, a revenue recognition automation solution; Zuora CPQ for configuring deals, pricing, and quoting in a subscription business; Zuora Collect designed to handle the complicated function of collections associated with subscription-based businesses; and Zuora Marketplace. It sells its products through its direct sales force, global systems integrators, management consulting firms, resellers, technology, and ecosystem partners. Zuora, Inc. was incorporated in 2006 and is headquartered in Redwood City, California.",
      "market_cap": 1891174912,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "MARIN SOFTWARE INC": {
    "details": {
      "summary": "Marin Software Incorporated, together with its subsidiaries, provides enterprise marketing software for advertisers and agencies in the United States, the United Kingdom, and internationally. It offers MarinOne, a search, social, and eCommerce advertising platform; Marin Search to manage advertising campaigns for advertisers and agencies; and Marin Social that enables advertisers to manage their Facebook, Instagram, and Twitter advertising, as well as managed services. The company markets and sells its solutions to advertisers directly, and through advertising agencies that use its platform on behalf of their customers. Marin Software Incorporated was incorporated in 2006 and is headquartered in San Francisco, California.",
      "market_cap": 46632124,
      "dividend_yield": null
    },
    "roce": -29.024933949801852,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-14062000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-14062000851000"
    },
    "high_low": {
      "high": 27.260000228881836,
      "low": 21.549999237060547
    }
  },
  "PHUNWARE INC": {
    "details": {
      "summary": "Phunware, Inc., together with its subsidiaries, provides integrated software platform that equips companies with the products, solutions, and services to engage, manage, and monetize their mobile application portfolios worldwide. Its products and services include cloud-based mobile software that licenses in software development kits (SDKs) form utilized inside mobile applications, such as analytics that provides data related to application use and engagement; content management that allows application admins to create and manage app content in a cloud-based portal; alerts, notifications, and messaging; marketing automation that enables location-triggered messages and workflow; advertising; and location-based services that include mapping, navigation, wayfinding, workflow, asset management, and policy enforcement. The company also engages the integration of its SDK licenses into existing applications maintained by its customers, as well as custom application development and support services; provision of cloud-based vertical solutions for healthcare, retail, sports, aviation, real estate, hospitality, education, and other applications; and offering application transactions, including re-occurring and one-time transactional media purchases for application discovery, user acquisition and audience building, audience engagement, and audience monetization. Phunware, Inc. was incorporated in 2009 and is headquartered in Austin, Texas.",
      "market_cap": 262794720,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "SMARTSHEET INC": {
    "details": {
      "summary": "Smartsheet Inc. provides cloud-based platform for execution of work. It enables teams and organizations to plan, capture, manage, automate, and report on work. The company offers Dashboards that provides real-time visibility into the status of work to align individuals, managers, and executives; Portals to easily locate and access from any device the resources available for a project without IT assistance; Cardview to organize, share, and act on workflows; and Grid to keep teams on task by easily tracking multiple moving parts. It also provides Projects, which offers interface with capabilities that foster collaboration among teams and organizations to enhance work execution; Calendar that align teams and organizations by connecting deadlines to workflows; Forms that enable business users to collect information in a structured and consistent format; Automated actions that automates repetitive processes; and Integrations that enable organizations and teams to connect, sync, and extend their existing enterprise applications across their workflows to create work execution. In addition, the company offers WorkApps to build easy to navigate apps in a few minutes; Connectors that provide embedded integrations with industry-leading systems of record; Control Center to achieve consistent work execution; Accelerators, which are pre-packaged solutions for specific and repeatable use cases; Dynamic View; Data Uploader; Bridge to build intelligent workflows and automate business processes across platforms; 10,000ft to plan and allocate resources across projects; and Brandfolder. It serves aerospace, automotive, biotechnology, consumer, e-commerce, education, finance, government, healthcare, IT services, marketing, media, non-profit, publishing, software, technology, and travel sectors. The company was formerly known as Smartsheet.com, Inc. and changed its name to Smartsheet Inc. in February 2017. Smartsheet Inc. was founded in 2005 and is based in Bellevue, Washington.",
      "market_cap": 6496039936,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "RIOT BLOCKCHAIN INC": {
    "details": {
      "summary": "Riot Blockchain, Inc., together with its subsidiaries, focuses on cryptocurrency mining operation in North America. The company primarily focuses on bitcoin mining. As of December 31, 2020, it operated a fleet of 7,043 miners. The company was formerly known as Bioptix, Inc. and changed its name to Riot Blockchain, Inc. in October 2017. Riot Blockchain, Inc. was incorporated in 2000 and is based in Castle Rock, Colorado.",
      "market_cap": 2276866048,
      "dividend_yield": null
    },
    "roce": -1.5734018455224652,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-22359000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-2235900026324000"
    },
    "high_low": {
      "high": 63.70000076293945,
      "low": 59.5
    }
  },
  "BSQUARE CORP": {
    "details": {
      "summary": "BSQUARE Corporation provides software solutions and related engineering services to businesses that develop, market, and sell standalone intelligent systems in North America, Europe, and Asia. It operates through two segments, Partner Solutions and Edge to Cloud. The company designs, configures, and deploys technologies to solve problems of manufacturers and operators of connected devices. It offers software that connect devices to create intelligent systems that are cloud-enabled, contribute critical data, and facilitate distributed control and decision making. The company also resells Windows IoT, Windows Embedded, and Windows Server IoT software, as well as system utility software for Adobe and McAfee; and provides license compliance services, technical support, and manufacturing support. In addition, it provides operating system configuration, fleet transition, 24/7 IoT operations, data engineering, and software utilities and professional services. The company serves original equipment manufacturers, original design manufacturers, silicon vendors, and peripheral vendors. BSQUARE Corporation was incorporated in 1994 and is headquartered in Seattle, Washington.",
      "market_cap": 35014212,
      "dividend_yield": null
    },
    "roce": -9.566884617275454,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-3892000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-389200070000"
    },
    "high_low": {
      "high": 8.199999809265137,
      "low": 4.829999923706055
    }
  },
  "ISSUER DIRECT CORP": {
    "details": {
      "summary": "Issuer Direct Corporation provides shareholder communications and compliance platforms, technologies, and services in the United States and internationally. The company provides Platform id., a cloud-based subscription platform that manages the events of customers to distribute their messages to constituents, investors, markets, and regulatory systems; whistleblower hotline, which delivers secure notifications and basic incident workflow management processes that align with a company's corporate governance whistleblower policy; proxy module, a real-time voting platform for customers and their shareholders of record; and stock transfer module, a cloud-based platform, which provides access to real-time information about their shareholders, stock ledgers, and reports, as well as issues new shares. It also offers ACCESSWIRE, a news dissemination and media outreach service; and VisualWebcaster Platform, a cloud-based webcast, webinar, and virtual meeting platform that delivers live and on-demand streaming of events to audiences of various sizes, as well as allows customers to create, produce, and deliver events. In addition, the company provides investor relations content network, a series of data feeds, which include news feeds, stock feeds, fundamentals, regulatory filings, corporate governance, and other components; and professional conference and events software, a mobile app that offers organizers, issuers, and investors to register, request, and approve one-on-one meetings, as well as manage schedules, perform event promotion and sponsorship, print attendee badges, and manage lodging. It serves corporate issuers, public and private companies, law firms, brokerage firms, investment banks, and mutual funds; and professional firms, such as investor relations and public relations firms, as well as the accounting and legal communities. Issuer Direct Corporation was incorporated in 1988 and is headquartered in Raleigh, North Carolina.",
      "market_cap": 104973896,
      "dividend_yield": null
    },
    "roce": 11.18816320430429,
    "ebit": {
      "2021-01-01SEP2021-12-31": "3743000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "37430001143000"
    },
    "high_low": {
      "high": 33.060001373291016,
      "low": 31.5
    }
  },
  "DATTO HOLDING CORP": {
    "details": {
      "summary": "Datto Holding Corp. provides cloud-based software and technology solutions for delivery through the managed service provider (MSP) channel to small and medium businesses in the United States and internationally. Its Unified Continuity products include Business Continuity and Disaster Recovery that protects servers and workstations, and minimize downtime; Cloud Continuity, an image-based continuity solution for Windows-based laptops and desktops; SaaS Protection, an automated and secure backup and restoration product; Workplace, a cloud-hosted file sync and share solution, which enable end-users to synchronize files across platforms, including mobile devices; and File Protection, an MSP-managed secure and scalable backup product that enables MSPs to protect and recover files and folders on workstations and laptops. The company's networking Products comprise access points, switches, edge routers, and managed power devices. Its business management products consist of Autotask Professional Services Automation, an IT business management product; and remote monitoring and management. The company was formerly known as Merritt Topco, Inc. and changed its name to Datto Holding Corp. in January 2020. Datto Holding Corp. was founded in 2007 and is headquartered in Norwalk, Connecticut.",
      "market_cap": 4200760320,
      "dividend_yield": null
    },
    "roce": 3.6122357488461336,
    "ebit": {
      "2021-01-01SEP2021-12-31": "62204000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "6220400032044000"
    },
    "high_low": {
      "high": 28.2549991607666,
      "low": 27.68000030517578
    }
  },
  "PAGERDUTY INC": {
    "details": {
      "summary": "PagerDuty, Inc. operates a digital operations management platform in the United States and internationally. Its platform harnesses digital signals from virtually any software-enabled system or device, combines it with human response data, and orchestrates teams to take the right actions in real time. The company's platform provides on-call management, event intelligence, incident response, business visibility, and advanced analytics solutions to address digital operations management requirements. It serves various industries, including software and technology, telecommunications, retail, travel and hospitality, media and entertainment, and financial services. PagerDuty, Inc. was founded in 2009 and is headquartered in San Francisco, California.",
      "market_cap": 3002421504,
      "dividend_yield": null
    },
    "roce": -17.55278208256681,
    "ebit": {
      "2021-02-01SEP2022-01-31": "-101711000"
    },
    "ebitda": {
      "2021-02-01SEP2022-01-31": "-1017110008356000"
    },
    "high_low": {
      "high": 50.33000183105469,
      "low": 47.349998474121094
    }
  },
  "GUIDEWIRE SOFTWARE INC": {
    "details": {
      "summary": "Guidewire Software, Inc. provides software products for property and casualty insurers worldwide. The company offers Guidewire InsuranceSuite comprising Guidewire PolicyCenter, BillingCenter, and ClaimCenter applications. It also provides Guidewire InsuranceNow, a cloud-based platform that offers policy, billing, and claims management functionality to insurers; and Guidewire InsuranceSuite for Self-Managed. In addition, the company offers Guidewire Rating Management to manage the pricing of insurance products; Guidewire Reinsurance Management to use rules-based logic to execute reinsurance strategy through underwriting and claims processes; Guidewire Client Data Management to capitalize on customer information; and Guidewire Product Content Management that offers software tools and standards-based line-of-business templates to introduce and modify products. Further, it provides Guidewire Underwriting Management, a cloud-based integrated business application; Guidewire AppReader, a submission intake management solution; Guidewire ClaimCenter Package for the London market supports the claims workflow used by London Market insurers and brokers; Guidewire Digital Engagement Applications, which enable insurers to provide digital experiences to customers, agents, vendors, and field personnel through their device of choice; and Guidewire for Salesforce to provide customer information regarding policies and claims. Additionally, the company offers Guidewire Predictive Analytics, a set of cloud-native applications; Guidewire Risk Insights that allows insurers to assess new and evolving risks; Guidewire Business Intelligence that allows insurers to measure business performance; Guidewire DataHub, an operational data store; and Guidewire InfoCenter, a business intelligence warehouse, as well as implementation and integration, and professional services. The company was founded in 2001 and is headquartered in San Mateo, California.",
      "market_cap": 7803469312,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "BLACKLINE INC": {
    "details": {
      "summary": "BlackLine, Inc. provides cloud-based solutions to automate and streamline accounting and finance operations in the United States and internationally. It offers financial close management solutions that include account reconciliations providing a centralized workspace from which users can collaborate to complete account reconciliations; transaction matching that analyzes and reconciles high volumes of individual transactions from different sources of data based upon user-configured logic; task management, which enables users to create and manage processes and task lists; journal entry that allows users to manually or automatically generate, review, and post manual journal entries; variance analysis that monitors and identifies anomalous fluctuations in balance sheet and income statement account balances; consolidation integrity manager that manages the automated system-to-system tie-out process that occurs during the consolidation phase of the financial close; and compliance that facilitates compliance-related initiatives, consolidates project management, and provides visibility over control self-assessments and testing. The company also provides cash application that drives end-to-end process from an invoice to cash in the bank. In addition, it offers intercompany workflow that stores permissions by entity and transaction type, ensuring that both the initiator and the approver of the intercompany transaction are authorized to conduct business; intercompany processing, which records an organization's intercompany transactions; and netting and settlement that generates a real-time, aggregated settlement matrix, which shows the balance of transactions across an entire organization. The company sells its solutions primarily through direct sales force to multinational corporations, large domestic enterprises, and mid-market companies across various industries. BlackLine, Inc. was founded in 2001 and is headquartered in Woodland Hills, California.",
      "market_cap": 4361021440,
      "dividend_yield": null
    },
    "roce": -2.5828745265053334,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-38614000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-386140007600000"
    },
    "high_low": {
      "high": 135.0,
      "low": 129.32000732421875
    }
  },
  "RINGCENTRAL INC": {
    "details": {
      "summary": "RingCentral, Inc. provides software-as-a-service solutions that enable businesses to communicate, collaborate, and connect in North America. Its products include RingCentral Office that provides communication and collaboration across various modes, including high-definition voice, video, SMS, messaging and collaboration, conferencing, online meetings, and fax; RingCentral Contact Center, a collaborative contact center solution that delivers omni-channel; and RingCentral Engage Digital, a digital customer engagement platform that allows enterprises to interact with their customers. The company's products also comprise RingCentral Engage Voice, a cloud-based outbound/blended customer engagement platform for midsize and enterprise companies; RingCentral Glip, a team messaging and collaboration solution that allows a range of teams to stay connected through various modes of communication through an integration with RingCentral Office; and RingCentral Live Reports, an add-on for RingCentral Office customers to Gatherf real-time information. In addition, it offers RingCentral Professional, a cloud based virtual telephone service that provides inbound call answering and management services for professionals; and RingCentral Fax that provides online fax capabilities. The company serves a range of industries, including financial services, education, healthcare, legal services, real estate, retail, technology, insurance, construction, hospitality, and state and local government, as well as others. It sells its products through a network of direct sales representatives, as well as sales agents, resellers, and channel partners. RingCentral, Inc. has strategic partnerships with Alcatel-Lucent Enterprise; and Vodafone Business. The company was incorporated in 1999 and is headquartered in Belmont, California.",
      "market_cap": 11450518528,
      "dividend_yield": null
    },
    "roce": -14.701410631201076,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-301786000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-301786000125292000"
    },
    "high_low": {
      "high": 337.3399963378906,
      "low": 327.1099853515625
    }
  },
  "SPROUT SOCIAL INC": {
    "details": {
      "summary": "Sprout Social, Inc. designs, develops, and operates a web-based social media management tool in Americas, EMEA, and the Asia Pacific. The company offers cloud software that brings together social messaging, data, and workflows in a unified system of record, intelligence, and action. It provides various integrated tools in a range of functions comprising social engagement/response, publishing, reporting and analytics, social listening and business intelligence, reputation management, employee advocacy, and automation and workflows. The company's tools serves a range of use-cases within its customers' organizations, including social and community management, public relations, marketing, customer service, sales and customer acquisition, recruiting and hiring, product development, and business strategy. It also offers professional services, which primarily consist of consulting and training services. The company serves approximately 26,000 customers across small-and-medium-sized businesses, mid-market companies, enterprises, and marketing agencies, as well as government, non-profit, and educational institutions. Sprout Social, Inc. was incorporated in 2010 and is headquartered in Chicago, Illinois.",
      "market_cap": 4238907392,
      "dividend_yield": null
    },
    "roce": -16.891778119888386,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-28089000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-280890003000000"
    },
    "high_low": {
      "high": 145.4199981689453,
      "low": 139.22000122070312
    }
  },
  "RAPID7 INC": {
    "details": {
      "summary": "Rapid7, Inc. provides cyber security solutions. The company offers a cloud-native insight platform that enables customers to create and manage analytics-driven cyber security risk management programs. Its platform includes InsightIDR, an incident detection and response solution; InsightCloudSec, a solution that integrates posture management, workload protection, infrastructure entitlements management, infrastructure-as-code security, and Kubernetes protection; InsightVM, a vulnerability risk management solution that is designed to provide a way to collect vulnerability data, prioritize risk, and automate remediation; InsightAppSec, which provides application security testing that analyzes web applications for security vulnerabilities; and InsightConnect, a security orchestration and automation response solution that is used by security professionals. The company's other products include DivvyCloud, a cloud security posture management solution; Nexpose, an on-premises version of company's vulnerability risk management solution; AppSpider, an on-premises version of company's application security testing solution; and Metasploit, a penetration testing software solution, as well as professional services. It offers its products through term or perpetual software licenses, cloud-based subscriptions, and managed services. The company serves customers in a range of industries, including technology, energy, financial services, healthcare and life sciences, manufacturing, media and entertainment, retail, education, real estate, transportation, government, and professional services industries through sales teams, and indirect channel partner relationships, as well as directly in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company was incorporated in 2000 and is headquartered in Boston, Massachusetts.",
      "market_cap": 6128259584,
      "dividend_yield": null
    },
    "roce": -14.512329406247318,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-120065000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-12006500033501000"
    },
    "high_low": {
      "high": 145.0,
      "low": 137.97000122070312
    }
  },
  "AWARE INC": {
    "details": {
      "summary": "Aware, Inc. provides biometrics software products and solutions in the United States, the United Kingdom, and internationally. It offers biometrics software products, including biometric search and matching software development kits (SDKs); biometric enrollment SDKs and application programming interfaces (APIs); and imaging products for medical and advanced imaging applications, such as JPEG2000 product to compress, store, and display images, as well as software maintenance services. The company also provides Knomi mobile biometric authentication framework; AwareABIS, an automated biometric identification system; AFIX suite of products for small-scale law enforcement focused biometric identification; BioSP biometric services platform; WebEnroll, a browser-based biometric enrollment and data management solution; and Indigo, a cloud-based biometric API and turnkey service. In addition, it offers program management and software engineering services, including project planning and management; system and architecture design; software design, development, customization, configuration, and testing; and software integration and installation. The company's software portfolio enables government agencies and commercial entities to enrol, identify, authenticate, and enable using biometrics, such as fingerprints, faces, irises, and voices. The company sells its products through systems integrators, original equipment manufacturers, value added resellers, and partners, as well as directly to end user customers. Aware, Inc. was incorporated in 1986 and is headquartered in Bedford, Massachusetts.",
      "market_cap": 68559208,
      "dividend_yield": null
    },
    "roce": -14.301463689247514,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-6097000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-6097000687000"
    },
    "high_low": {
      "high": 4.269999980926514,
      "low": 4.079999923706055
    }
  },
  "SMITH MICRO SOFTWARE INC": {
    "details": {
      "summary": "Smith Micro Software, Inc. develops and sells software to enhance the mobile experience to wireless and cable service providers worldwide. The company provides SafePath Family, SafePath IoT, and SafePath Home product suite that offers tools to protect digital lifestyles and manage connected devices inside and outside the home; and CommSuite that allows users to manage voice messages, as well as voice-to-text transcription messaging. In addition, the company provides ViewSpot, a retail display management platform that provides on-screen and interactive demos to wireless carriers and retailers, as well as technical support and customer services. Smith Micro Software, Inc. was founded in 1982 and is headquartered in Pittsburgh, Pennsylvania.",
      "market_cap": 181157120,
      "dividend_yield": null
    },
    "roce": -29.190096992112313,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-30938000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-309380009338000"
    },
    "high_low": {
      "high": 6.679999828338623,
      "low": 6.510000228881836
    }
  },
  "BOXLIGHT CORP": {
    "details": {
      "summary": "Boxlight Corporation, an education technology company, develops, sells, and services interactive classroom solutions for the education market worldwide. The company provides a range of interactive classroom technology products primarily targeted at the K-12 education market. Its products include interactive projectors, interactive flat panel displays, interactive touch projectors, noninteractive projectors, touchboards, and MimioTeach that could turn any whiteboard interactive; and accessory document cameras, teacher pads for remote control, and assessment systems. The company also offers MimioStudio Interactive Instructional Software that enables the creation, editing, and presentation of interactive instructional lessons and activities; MimioMobile, a software accessory for MimioStudio; Oktopus Instructional and Whiteboarding Software that enables the creation, editing, and presentation of interactive instructional lessons and activities; Notes+, a software accessory for use with Oktopus software; and GameZones and MimioInteract, which are multi-student interactive gaming software. In addition, it offers MimioClarity that distributes audio around the classroom and integrates with the front-of-class display; Mimio MyBot system that bridges the gap between learning about robotics in the classroom and the application of robotics; Robo3D printers; MyStemKits, which offers standards-driven lesson plans for grades K-12 math and science teachers; and MimioView document camera, as well as peripherals and accessories, such as amplified speaker systems, mobile carts, installation accessories, and wall-mount accessories for interactive and standard projectors, and LED flat panels. Further, the company distributes interactive projectors and LED flat panels; and provides classroom training, professional development, and educator certification services. The company was formerly known as Logical Choice Corporation. Boxlight Corporation was incorporated in 2014 and is headquartered in Lawrenceville, Georgia.",
      "market_cap": 76954280,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "CROWDSTRIKE HOLDINGS INC": {
    "details": {
      "summary": "CrowdStrike Holdings, Inc. provides cloud-delivered solutions for endpoint and cloud workload protection in the United States, Australia, Germany, India, Israel, Romania, and the United Kingdom. It offers 19 cloud modules on its Falcon platform through a software as a service subscription-based model that covers various security markets, such as corporate workload security, security and vulnerability management, managed security services, IT operations management, threat intelligence services, identity protection, and log management. The company primarily sells its platform and cloud modules through its direct sales team. CrowdStrike Holdings, Inc. was incorporated in 2011 and is headquartered in Sunnyvale, California.",
      "market_cap": 47716274176,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "ALARM.COM HOLDINGS INC": {
    "details": {
      "summary": "Alarm.com Holdings, Inc. provides cloud-based solutions for smart residential and commercial properties in the United States and internationally. It operates in two segments, Alarm.com and Other. The company provides interactive security solutions to control and monitor their security systems, as well as connected security devices, including door locks, motion sensors, door locks, garage doors, thermostats, and video cameras; and high definition video monitoring solutions, such as video analytics, live streaming, video doorbell, video clips, video alerts, continuous high definition recording, and commercial video surveillance solutions. It also offers intelligent automation and energy management solutions comprising scenes button; smart thermostat schedules; responsive savings; precision comfort; energy usage monitoring; heating, ventilation, and air conditioning monitoring services; whole home water safety solutions; geo-services; and demand response programs. In addition, the company provides commercial solutions, such as daily safeguards, commercial grade video, energy savings, protection for valuables and inventory, temperature monitoring, multi-site management and access control, operational insights, early problem identification, simple to use, professionally supported, and easy to maintain. Further, it offers service provider solutions, including a permission-based online portal that offers account management, sales, marketing, training, and support tools; installation and support tools; business management services; sales, marketing, and training services; and home builder programs, as well as wellness solutions. The company serves residential and commercial subscribers. Alarm.com Holdings, Inc. was founded in 2000 and is headquartered in Tysons, Virginia.",
      "market_cap": 3388588544,
      "dividend_yield": null
    },
    "roce": 0.1932845225485724,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-250000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-250000400000"
    },
    "high_low": {
      "high": 95.82599639892578,
      "low": 93.72000122070312
    }
  },
  "DOCUSIGN INC": {
    "details": {
      "summary": "DocuSign, Inc. provides cloud based software in the United States and internationally. The company provides e-signature solution that enables businesses to digitally prepare, sign, act on, and manage agreements. It also offers CLM, which automates workflows across the entire agreement process; Insights that use artificial intelligence (AI) to search and analyze agreements by legal concepts and clauses; Gen for Salesforce, which allows sales representatives to automatically generate agreements with a few clicks from within Salesforce; Negotiate for Salesforce that supports for approvals, document comparisons, and version control; Analyzer, which helps customers understand what they're signing before they sign it; and CLM+ that provide AI-driven contract lifecycle management. The company provides Guided Forms, which enable complex forms to be filled via an interactive and step-by-step process; Click that supports no-signature-required agreements for standard terms and consents; Identify, a signer-identification option for checking government-issued IDs; Standards-Based Signatures, which support signatures that involve digital certificates; Payments that enables customers to collect signatures and payment; and eNotary, which offers the ability to execute electronic notarial acts. It offers industry-specific cloud offerings, including Rooms for Real Estate that provides a way for brokers and agents to manage the entire real estate transaction digitally; Rooms for Mortgage, which offers digital workspace to create and close mortgages; FedRAMP, an authorized version of DocuSign eSignature for U.S. federal government agencies; and life sciences modules that support compliance with the electronic signature practices. The company sells its products through direct, partner-assisted, and Web-based sales. It serves enterprise, commercial, and small businesses. The company was incorporated in 2003 and is headquartered in San Francisco, California.",
      "market_cap": 18899232768,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "TWILIO INC": {
    "details": {
      "summary": "Twilio Inc., together with its subsidiaries, provides a cloud communications platform that enables developers to build, scale, and operate customer engagement within software applications in the United States and internationally. Its customer engagement platform provides a set of application programming interfaces that handle the higher-level communication logic needed for nearly every type of customer engagement, as well as enable developers to embed voice, messaging, video, and email capabilities into their applications. The company was incorporated in 2008 and is headquartered in San Francisco, California.",
      "market_cap": 28472006656,
      "dividend_yield": null
    },
    "roce": -7.446770439611135,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-915584000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-915584000258378000"
    },
    "high_low": {
      "high": 412.67999267578125,
      "low": 404.3699951171875
    }
  },
  "MONGODB INC": {
    "details": {
      "summary": "MongoDB, Inc. provides general purpose database platform worldwide. The company offers MongoDB Enterprise Advanced, a commercial database server for enterprise customers to run in the cloud, on-premise, or in a hybrid environment; MongoDB Atlas, a hosted multi-cloud database-as-a-service solution; and Community Server, a free-to-download version of its database, which includes the functionality that developers need to get started with MongoDB. It also provides professional services, such as consulting and training. The company was formerly known as 10gen, Inc. and changed its name to MongoDB, Inc. in August 2013. MongoDB, Inc. was incorporated in 2007 and is headquartered in New York, New York.",
      "market_cap": 26574409728,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "BOX INC": {
    "details": {
      "summary": "Box, Inc. provides a cloud content management platform that enables organizations of various sizes to manage and share their content from anywhere on any device. The company's Software-as-a-Service platform enables users to collaborate on content internally and with external parties, automate content-driven business processes, develop custom applications, and implement data protection, security, and compliance features to comply with legal and regulatory requirements, internal policies, and industry standards and regulations. It offers web, mobile and desktop applications for cloud content management on a platform for developing custom applications, as well as industry-specific capabilities. As of January 31, 2021, the company had over 105,000 paying organizations, and its solution was offered in 25 languages; and 77.7 million registered users. Box, Inc. serves healthcare, government, life sciences, and financial services industries in the United States and internationally. The company was formerly known as Box.net, Inc. and changed its name to Box, Inc. in November 2011. Box, Inc. was founded in 2005 and is headquartered in Redwood City, California.",
      "market_cap": 4155366144,
      "dividend_yield": null
    },
    "roce": -4.104696048045121,
    "ebit": {
      "2021-02-01SEP2022-01-31": "-27626000"
    },
    "ebitda": {
      "2021-02-01SEP2022-01-31": "-2762600078234000"
    },
    "high_low": {
      "high": 28.18000030517578,
      "low": 27.232999801635742
    }
  },
  "NORTONLIFELOCK INC": {
    "details": {
      "summary": "NortonLifeLock Inc. provides cyber safety solutions for consumers worldwide. The company offers Norton 360, an integrated platform provides extensive cyber safety coverage and a subscription service providing protection for PCs, Macs, and mobile devices against malware, viruses, adware, ransomware, and other online threats on various platforms; and LifeLock identity theft protection solution that offers monitoring, alerts, and restoration services to its customers. It also provides Norton Secure VPN solution enhances security and online privacy by providing an encrypted data tunnel; Privacy Monitor Assistant, an on-demand, white glove service where agents help members delete personal information from data brokers online; Home Title Protect product detects fraud and notifies members; and Avira Security, a consumer-focused portfolio of cybersecurity and privacy solutions. The company markets and sells its products and related services through retailers, telecom service providers, hardware original equipment manufacturers, and employee benefit providers, as well as e-commerce platform. It operates in the United States, Canada, Latin America, Europe, the Middle East, Africa, the Asia Pacific, and Japan. The company was formerly known as Symantec Corporation and changed its name to NortonLifeLock Inc. in November 2019. NortonLifeLock Inc. was founded in 1982 and is headquartered in Tempe, Arizona.",
      "market_cap": 15969175552,
      "dividend_yield": 0.0176
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "DIGIMARC CORP": {
    "details": {
      "summary": "Digimarc Corporation provides automatic identification solutions to commercial and government customers in the United States and internationally. The company offers Digimarc Platform for the identification, discovery, and management of media, which includes Digimarc Barcode, a data carrier that integrates the identification function; Digimarc Discover, a software for computing devices and network interfaces that recognize and decode indicia of the identity of media; and Digimarc Verify, a suite of software tools used to inspect and verify that the identification and discovery of media. Its solutions are used in various media identification and management products and solutions, such as retail point of sale transaction processing; track and trace of products within the supply chain; quality control in manufacturing processes; inventory management and planogram compliance; sorting of consumer packaged goods in recycling streams; counterfeiting and piracy deterrence; online e-publication piracy protection; content identification and media management; authentication and monitoring; linking to networks and providing access to information; and enhanced services in support of mobile commerce. The company offers its solutions directly and through its business partners. Digimarc Corporation was incorporated in 2008 and is based in Beaverton, Oregon.",
      "market_cap": 448687392,
      "dividend_yield": null
    },
    "roce": -69.7445766270119,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-39866000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-398660001370000"
    },
    "high_low": {
      "high": 53.7400016784668,
      "low": 52.099998474121094
    }
  },
  "AUTOMATIC DATA PROCESSING": {
    "details": {
      "summary": "Automatic Data Processing, Inc. provides cloud-based human capital management solutions worldwide. It operates in two segments, Employer Services and Professional Employer Organization (PEO). The Employer Services segment offers strategic, cloud-based platforms, and human resources (HR) outsourcing solutions. Its offerings include payroll, benefits administration, talent management, HR management, workforce management, insurance, retirement, and compliance services. The PEO Services segment provides HR outsourcing solutions to small and mid-sized businesses through a co-employment model. This segment offers benefits package, protection and compliance, talent engagement, comprehensive outsourcing, and recruitment process outsourcing services. The company was founded in 1949 and is headquartered in Roseland, New Jersey.",
      "market_cap": 90466934784,
      "dividend_yield": 0.02
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "BLACKBOXSTOCKS INC": {
    "details": {
      "summary": "Blackboxstocks Inc. develops and markets financial technology and social media hybrid platform. It offers Blackbox System, a subscription-based software as a service that provides real-time proprietary analytics and news for stock and options traders. The company is headquartered in Dallas, Texas.",
      "market_cap": 23911806,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "MICROSOFT CORP": {
    "details": {
      "summary": "Microsoft Corporation develops, licenses, and supports software, services, devices, and solutions worldwide. Its Productivity and Business Processes segment offers Office, Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, and Skype for Business, as well as related Client Access Licenses (CAL); Skype, Outlook.com, OneDrive, and LinkedIn; and Dynamics 365, a set of cloud-based and on-premises business solutions for organizations and enterprise divisions. Its Intelligent Cloud segment licenses SQL, Windows Servers, Visual Studio, System Center, and related CALs; GitHub that provides a collaboration platform and code hosting service for developers; and Azure, a cloud platform. It also offers support services and Microsoft consulting services to assist customers in developing, deploying, and managing Microsoft server and desktop solutions; and training and certification on Microsoft products. Its More Personal Computing segment provides Windows original equipment manufacturer (OEM) licensing and other non-volume licensing of the Windows operating system; Windows Commercial, such as volume licensing of the Windows operating system, Windows cloud services, and other Windows commercial offerings; patent licensing; Windows Internet of Things; and MSN advertising. It also offers Surface, PC accessories, PCs, tablets, gaming and entertainment consoles, and other devices; Gaming, including Xbox hardware, and Xbox content and services; video games and third-party video game royalties; and Search, including Bing and Microsoft advertising. It sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online stores, and retail stores. It has collaborations with Dynatrace, Inc., Morgan Stanley, Micro Focus, WPP plc, ACI Worldwide, Inc., and iCIMS, Inc., as well as strategic relationships with Avaya Holdings Corp. and wejo Limited. Microsoft Corporation was founded in 1975 and is based in Redmond, Washington.",
      "market_cap": 2255622242304,
      "dividend_yield": 0.007500000000000001
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "TRADE DESK INC": {
    "details": {
      "summary": "The Trade Desk, Inc. operates as a technology company in the United States and internationally. The company operates a self-service cloud-based platform that allows buyers to create, manage, and optimize data-driven digital advertising campaigns in various ad formats and channels, including display, video, audio, in-app, native and social, and on various devices, such as computers, mobile devices, and connected TV. It also provides data and other value-added services, as well as platform features. The company serves advertising agencies and other service providers for advertisers. The Trade Desk, Inc. was incorporated in 2009 and is headquartered in Ventura, California.",
      "market_cap": 35429650432,
      "dividend_yield": null
    },
    "roce": 7.035768741879387,
    "ebit": {
      "2021-01-01SEP2021-12-31": "124817000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "12481700042219000"
    },
    "high_low": {
      "high": 114.08999633789062,
      "low": 107.05000305175781
    }
  },
  "BLACKBAUD INC": {
    "details": {
      "summary": "Blackbaud, Inc. provides cloud software solutions to nonprofits, foundations, companies, education institutions, healthcare organizations, and other social good entities in the United States and internationally. The company offers fundraising and relationship management solutions, such as Blackbaud Raiser's Edge NXT and Blackbaud CRM, Blackbaud TeamRaiser, Blackbaud Peer-to-Peer Fundraising, and Blackbaud Guided Fundraising and Blackbaud Volunteer Network Fundraising; marketing and engagement solutions, including Blackbaud Luminate Online, Blackbaud Luminate Advocacy, Blackbaud Online Express, and Blackbaud School Website System; and financial management solutions comprising Blackbaud Financial Edge NXT, Blackbaud Tuition Management, and Blackbaud Financial Aid Management. It also provides grant and award management solutions, consisting of Blackbaud Grantmaking, Blackbaud Outcomes, and Blackbaud Award Management; organizational and program management, such as Blackbaud Student Information System, Blackbaud Learning Management System, Blackbaud Enrollment Management System, Blackbaud Altru, and Blackbaud Church Management; social responsibility solutions, which includes YourCause Grants Connect and YourCause CSR; Blackbaud Merchant Services and Blackbaud Purchase Cards payment services; and Blackbaud's Intelligence for Good solutions, as well as donor acquisition, prospect research, data enrichment, and benchmarking and performance management solutions and services. It sells its solutions and related services through its direct sales force. The company was founded in 1981 and is headquartered in Charleston, South Carolina.",
      "market_cap": 3185766144,
      "dividend_yield": null
    },
    "roce": 1.3376047605109602,
    "ebit": {
      "2021-01-01SEP2021-12-31": "24906000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "2490600082410000"
    },
    "high_low": {
      "high": 86.95999908447266,
      "low": 84.13999938964844
    }
  },
  "ALTERYX INC": {
    "details": {
      "summary": "Alteryx, Inc. provides end-to-end analytics platform for data analysts and scientists worldwide. Its analytic process automation software platform includes Alteryx Designer, a data profiling, preparation, blending, and analytics product used to create visual workflows or analytic processes; Alteryx Server, a server-based product for scheduling, sharing, and running analytic processes and applications in a Web-based environment; Alteryx Connect, a collaborative data exploration platform for discovering information assets and sharing recommendations across the enterprise; and Alteryx Promote, an analytics model management product for data scientists and analytics teams to build, manage, monitor, and deploy predictive models into real-time production applications. The company also offers Alteryx Analytics Gallery, a cloud-based collaboration offering that allows users to share workflows in a centralized repository; Alteryx Analytics Hub, a server-based product that provides a centralized and governed, web-based experience for process automation, collaboration, and analytics; Alteryx Intelligence Suite, a hub for machine learning and artificial intelligence capabilities for automated modeling, optical character recognition, and natural language processing; and Alteryx Community, which allow users to gain valuable insights in its platform. In addition, it provides technical support, instruction, and customer services. Alteryx has strategic relationship with Veritone. The company was formerly known as Alteryx, LLC and changed its name to Alteryx, Inc. in March 2011. Alteryx, Inc. was founded in 1997 and is headquartered in Irvine, California.",
      "market_cap": 4266459392,
      "dividend_yield": null
    },
    "roce": -11.443724070745922,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-136265000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-13626500016380000"
    },
    "high_low": {
      "high": 90.56999969482422,
      "low": 88.61000061035156
    }
  },
  "CLEANSPARK INC": {
    "details": {
      "summary": "CleanSpark, Inc. provides bitcoin mining and energy technology solutions worldwide. It operates in two segments, Digital Currency Mining and Energy. The Digital Currency Mining segment engages in mining of bitcoin. The energy segment provides engineering, design and software, custom hardware, open automated demand response, solar, and energy storage solutions for microgrids and distributed energy systems to military, commercial, and residential customers; and develops platforms that enables designing, building, operating, and managing of energy assets. This segment also offers microgrid energy modeling, energy market communications, and energy management solutions comprising mPulse and mVoult, which are control platforms that enables integration and optimization of multiple energy sources; Canvas, a middleware for grid operators and aggregators to administrate load shifting programs; Plaid, a middleware for controls and Internet-of-Things products companies to participate in load shifting programs; and mVSO, an energy modeling software for internal microgrid design, as well as owns gasification energy technologies for various applications, such as feedstock for the generation of di-methyl ether. In addition, it provides design, software development, and other technology-based consulting services; data center services, including rack space, power, and equipment; and various cloud services, such as virtual, virtual storage, and data backup services. The company was formerly known as Stratean Inc. and changed its name to CleanSpark, Inc. in November 2016. CleanSpark, Inc. was incorporated in 1987 and is headquartered in Henderson, Nevada.",
      "market_cap": 495715680,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "BIO-KEY INTERNATIONAL INC": {
    "details": {
      "summary": "BIO-key International, Inc., together with its subsidiaries, develops and markets fingerprint identification biometric technology, enterprise-ready identity access management solutions, and software solutions to commercial, government, and education customers in the United States and internationally. The company offers BIO-key PortalGuard and PortalGuard IDaaS solutions, a customer-controlled and neutral-by-design cloud-based identity platform that allows customers to integrate with any cloud or on-premise SaaS application, as well as windows device authentication through IAM platform. Its solutions enable its customers to secure their workforces and student populations; and make their partner networks more collaborative. In addition, it provides BIO-key VST and WEB-key products; and Civil and Large-Scale ID Infrastructure solutions develops finger-based biometric technology. Further, it offers finger scanners for enterprise and consumer markets under SideSwipe, EcoID, and SidePass brand names. The company was formerly known as SAC Technologies and changed its name to BIO-key International, Inc. in 2002. BIO-key International, Inc. was founded in 1993 and is headquartered in Wall, New Jersey.",
      "market_cap": 18174392,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "PEGASYSTEMS INC": {
    "details": {
      "summary": "Pegasystems Inc. develops, markets, licenses, hosts, and supports enterprise software applications in the United States, rest of the Americas, the United Kingdom, rest of Europe, the Middle East, Africa, and the Asia-Pacific. It provides Pega Platform, an application development product for clients; and Pega Infinity, a software platform that unifies customer engagement and digital process automation. The company offers customer engagement applications, including Pega Customer Decision Hub that enable enterprises to enhance customer acquisition and experiences across inbound, outbound, and paid media channels; Pega Sales Automation to automate and manage the sales process; and Pega Customer Service to anticipate customer needs, connect customers to people and systems, and automate customer interactions to evolve the customer service experience, as well as to allow enterprises to deliver interactions across channels and enhance employee productivity. It also provides intelligent automation software; Pega Cloud that allows clients to develop, test, and deploy applications and the Pega Platform using an Internet-based infrastructure; and guidance and implementation, technical support, and instructor-led and online training services. It primarily markets its software and services to financial services, life sciences, healthcare, communications and media, government, insurance, manufacturing and high tech, and consumer services markets through a direct sales force, as well as partnerships with technology providers and application developers. Pegasystems Inc. was incorporated in 1983 and is headquartered in Cambridge, Massachusetts.",
      "market_cap": 6498903040,
      "dividend_yield": 0.0011
    },
    "roce": -8.548839618563576,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-94732000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-9473200028593000"
    },
    "high_low": {
      "high": 143.66000366210938,
      "low": 140.4499969482422
    }
  },
  "XPERI HOLDING CORP": {
    "details": {
      "summary": "Xperi Holding Corporation, together with its subsidiaries, operates as a consumer and entertainment product/solutions licensing company worldwide. It operates through two segments, Product, and Intellectual Property Licensing. The company invents, develops, and delivers various technologies. It licenses audio, digital radio, imaging, edge-based machine learning, and multi-channel video user experience solutions to consumer electronics customers, automotive manufacturers, or supply chain partners. The company also provides licensing to multichannel video programming distributors, OTT video service providers, consumer electronics manufacturers, social media, and other new media companies in media industry; and memory, sensors, RF component, and foundry companies in semiconductor industry. It provides its technologies under the DTS, HD Radio, IMAX Enhanced, Invensas, TiVo, and Perceive brands. The company is headquartered in San Jose, California.",
      "market_cap": 1854362240,
      "dividend_yield": 0.012100000000000001
    },
    "roce": -11.917159114580478,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-271744000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-27174400023801000"
    },
    "high_low": {
      "high": 24.850000381469727,
      "low": 24.43000030517578
    }
  },
  "FIVE9 INC": {
    "details": {
      "summary": "Five9, Inc., together with its subsidiaries, provides cloud software for contact centers in the United States and internationally. The company offers virtual contact center cloud platform that delivers a suite of applications, which enables the breadth of contact center-related customer service, sales, and marketing functions. Its solution enables its clients to manage these customer interactions across various channels, including voice, chat, email, web, social media, and mobile, as well as through APIs. It serves customers in various industries comprising banking and financial services, business process outsourcers, consumer, healthcare, and technology. Five9, Inc. has an alliance agreement with Deloitte Digital to bring transformational Cloud Contact Center as a Service (CCaaS) solutions to clients. The company was incorporated in 2001 and is headquartered in San Ramon, California.",
      "market_cap": 7075735040,
      "dividend_yield": null
    },
    "roce": -5.432856175636272,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-56250000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-5625000038732000"
    },
    "high_low": {
      "high": 211.67999267578125,
      "low": 205.83999633789062
    }
  },
  "NETSOL TECHNOLOGIES INC": {
    "details": {
      "summary": "NetSol Technologies, Inc. designs, develops, markets, and exports software products to the automobile financing and leasing, banking, and financial services industries worldwide. The company offers NFS Ascent, a suite of financial applications for businesses in the finance and leasing industry. Its NFS Ascent constituent applications include Omni Point of Sale, a web-based application; Contract Management System (CMS), an application for managing and maintaining credit contracts; Wholesale Finance System (WFS), a system for automating and managing the lifecycle of wholesale finance; Dealer Auditor Access System, a web-based solution that could be used in conjunction with WFS or any third-party wholesale finance system; NFS Ascent On The Cloud, a cloud-version of NFS Ascent; and NFS Digital solutions covering Self Point of Sale, Mobile Account, Mobile Point of Sale, Mobile Dealer, Mobile Auditor, Mobile Collector, and Mobile Field Investigator. The company also provides Otoz Digital Auto-Retail, a white-labelled SaaS platform; Otoz Ecosystem, an API-based architecture; and Otoz Platform, a white label platform, which includes Dealer Tool and Customer App portals. In addition, it offers system integration, consulting, and IT products and services. It serves blue chip organizations, Dow-Jones 30 Industrials, Fortune 500 manufacturers and financial institutions, vehicle manufacturers, and enterprise technology providers. The company was incorporated in 1997 and is headquartered in Calabasas, California.",
      "market_cap": 43403768,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "DIGITAL TURBINE INC": {
    "details": {
      "summary": "Digital Turbine, Inc., through its subsidiaries, provides media and mobile communication products and solutions for mobile operators, application advertisers, publishers, device original equipment manufacturers (OEMs), and other third parties. Its application media software platform that enables mobile operators and OEMs to control, manage, and monetize devices. The company also provides programmatic advertising and targeted media delivery services; and other products and professional services directly related to the core platform. It operates in the United States, Canada, Europe, the Middle East, Africa, the Asia Pacific, China, Mexico, Central America, and South America. The company is headquartered in Austin, Texas.",
      "market_cap": 4158769920,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "VERINT SYSTEMS INC": {
    "details": {
      "summary": "Verint Systems Inc. provides customer engagement solutions worldwide. It offers various applications for use in Forecasting and Scheduling, which understands the work needed to meet and exceed customer expectations; Quality and Compliance that uses automation and analytics for customer interactions for attended and self-service channels; Interaction Insights, which extracts insights from structured and unstructured customer interactions and activities; Real-Time Work that supports in-the-moment workforce activities; Self-Service, which connects customers and employees with information, resources, and support; Case Management that helps employees to improve efficiency, time to resolution, compliance, and customer satisfaction; and Knowledge Management, which help agents to deliver stellar service with tools. The company also provides Digital Experience that monitors customer-initiated feedback via web and mobile channels; Enterprise Experience, which captures experience data across various channels and unify feedback; Interaction Experience that uses voice surveys and contact center interaction to understand and improve the effectiveness of people, products, and processes; and Predictive Experience, which listens and acts on customer and employee experiences. In addition, it offers engagement data management applications for data management, enrichment, and compliance solutions, as well as cloud platform services. The company was incorporated in 1994 and is headquartered in Melville, New York.",
      "market_cap": 3351550720,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "VARONIS SYSTEMS INC": {
    "details": {
      "summary": "Varonis Systems, Inc. provides software products and services that allow enterprises to manage, analyze, and secure enterprise data in North America, Europe, the Middle East, Africa, and internationally. Its software enables enterprises to protect data stored on premises and in the cloud, including sensitive files and emails; confidential personal data belonging to customers, and patients and employees' data; financial records; strategic and product plans; and other intellectual property. The company offers DatAdvantage that captures, aggregates, normalizes, and analyzes every data access event for users on Windows and UNIX/Linux servers, storage devices, email systems, and Intranet servers; and DatAlert that profiles users and their behaviors related to systems and data, detects and alerts on deviations that indicate compromise, and provides a Web-based dashboard and investigative interface. It also provides Data Classification Engine that identifies and tags data based on criteria set in various metadata dimensions, and provides business and information technology (IT) personnel with actionable intelligence about data; and DataPrivilege, which provides a self-service Web portal that allows users to request access to data necessary for their business functions, and owners to grant access without IT intervention. In addition, the company offers Data Transport Engine, which provides an execution engine that unifies the manipulation of data and metadata, translating business decisions, and instructions into technical commands, such as data migration or archiving; and DatAnswers that offers search functionality for enterprise data. It sells its products and services through a network of distributors and resellers. The company serves IT, security, and business personnel. Varonis Systems, Inc. was incorporated in 2004 and is headquartered in New York, New York.",
      "market_cap": 4722255872,
      "dividend_yield": null
    },
    "roce": -11.005546597440134,
    "ebit": {
      "2021-01-01SEP2021-12-31": "-98694000"
    },
    "ebitda": {
      "2021-01-01SEP2021-12-31": "-9869400010888000"
    },
    "high_low": {
      "high": 73.45999908447266,
      "low": 72.5
    }
  },
  "GSE SYSTEMS INC": {
    "details": {
      "summary": "GSE Systems, Inc. provides professional and technical engineering, staffing services, and simulation software to the power and process industries in the United States, Asia, Europe, and internationally. It operates in two segments, Performance Improvement Solutions and Nuclear Industry Training and Consulting. The Performance Improvement Solutions segment provides various simulation products, engineering services, and operation training systems for the nuclear, fossil fuel power generation, and process industries. The Nuclear Industry Training and Consulting segment offers instructors, procedure writers, technical engineers, project managers, work management specialists, and planners and training material developers for the nuclear power industry. The company markets its products and services through a network of direct sales staff, agents and representatives, and strategic alliance partners. GSE Systems, Inc. has a strategic collaboration with ABB Bailey Japan Limited to provide process simulation solutions for NIHONKAI LNG Niigata terminal located in Niigata, Japan. The company was founded in 1971 and is headquartered in Columbia, Maryland.",
      "market_cap": 38456368,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "INTRUSION INC": {
    "details": {
      "summary": "Intrusion Inc. develops, markets, and supports entity identification, data mining, cybercrime, and advanced persistent threat detection products in the United States. It offers INTRUSION Shield, a network detection and response security-as-a-service solution to identify and stop Zero-Day attacks and ransomware. The company also provides INTRUSION TraceCop, a big data tool that contains an inventory of network selectors and enrichments to support forensic investigations; and INTRUSION Savant, a network monitoring solution that uses the data available in TraceCop to identify suspicious traffic in real-time. In addition, it engages in the resale of standard commercially available computers and servers from various vendors; and provision of pre-and post-sales support services, such as network security design, system installation, and technical consulting services. The company serves US federal government entities, state and local government entities, and companies ranging from mid-market to large enterprises through a direct sales force and value-added resellers. The company was formerly known as Intrusion.com, Inc. and changed its name to Intrusion Inc. in November 2001. Intrusion Inc. was founded in 1983 and is headquartered in Plano, Texas.",
      "market_cap": 47358360,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  },
  "QUMU CORP": {
    "details": {
      "summary": "Qumu Corporation provides tools to create, manage, secure, distribute, and measure live and on-demand video content for the enterprises. It offers software on a license, cloud-hosted software as a service, or term software license basis; and sells third-party hardware appliances, as well as provides maintenance and support, and professional and other services. The company's platform provides video capture services; video content management services, such as creation and editing, analytics, automated workflows, security and access control, and speech search; and extensions and add-ons. It serves the banking, finance and insurance, manufacturing, services and consulting, telecom and technology, and biotech and health care markets, as well as government customers through direct sales and channel partners in North America, Europe, and Asia. The company was formerly known as Rimage Corporation and changed its name to Qumu Corporation in September 2013. Qumu Corporation was founded in 1978 and is headquartered in Minneapolis, Minnesota.",
      "market_cap": 30229400,
      "dividend_yield": null
    },
    "roce": "",
    "ebit": "",
    "ebitda": "",
    "high_low": ""
  }
}